{
    "Argent Knight: Artemis": {
        "character": "Rita Rossweisse",
        "version": "3.0",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Ice DMG, Freeze, Burst",
        "profile": "Long-range AOE DPS. Inflicts Hypothermia that slows enemies.Charged ATK removes 2 stacks of Hypothermia to deal massive DMG.Burst: Massive DPS increase. Freezes enemies as well.",
        "leader": "Herald of Dawn",
        "leaderEffect": "Team gains 10% Total DMG Multiplier to Charged or Combo ATKs. For teams with characters of 3 different types, attacks gain 12% Elemental DMG.",
        "special": "Charge: Frost Beam",
        "specialEffect": "Tap and hold the [ATK] button during the 5-sequence Basic ATK to remove 2 stacks of Hypothermia to deal massive DMG.Hold [ATK] button during any sequence of Basic ATK to unleash Charged ATK, which deals 100% ATK of AOE Ice DMG, removes 2 stacks (if any) of Hypothermia, seals enemies in Ice Cell, and deals 4 x 100% ATK of Ice DMG. Enemies will be frozen in Ice Cell.Normal mode: Each Charged ATK recovers 3 SP upon removing 2 stacks of Hypothermia.Burst mode: Charged ATK shuttles through enemies, deals 2 x 150% ATK of Ice DMG, and summons Crescent Harvest (summoned entity), which deals 5 x 125% ATK of Ice DMG with a spinning scythe in the position of the 1st enemy hit.Switch: Enhanced 3rd sequence of Basic ATK dealin 80% + 160% ATK of Physical DMG.",
        "passive": "Hypothermia",
        "passiveEffect": "Passive bonuses apply automatically.Hypothermia: When Crescent Harvest is present, hits from certain skills apply Hypothermia (2 stacks max) to enemies.1 stack of Hypothermia: Reduce enemy Ignore Interrupt for 10s and inflict minor Rime Trauma; 2 stack of Hypothermia: Reduce enemy Ignore Interrupt & Interrupt, slows their Attack and Move speed by 20% for 6s, and inflict minor Rime Trauma.Inflicting Hypothermia on enemies with 2 stacks will refresh the duration. Hypothermia does not work on enemies in Ice Cell.",
        "ultimate": "Rave of Artemis",
        "ultimateEffect": "Enters Burst mode: Gains Glacial Armor, Ignore Interrupt, and 60% Total DMG Reduction. Basic ATKs (BATK) gain Ice DMG, and the last hit of each BATK sequence turns Hypothermia Stack 2 into Ice Cell; Crescent Harvest (summoned entity) assists Rita during BATK and inflicts Hypothermia with ATK sequences 2 and 4.Lunar Burst: During Burst, spend 10 SP to cast Ultimate again to end Burst mode, deal 400% ATK of large AOE Ice DMG, and inflict Ice Cell for 3s (2s for Bosses); enemies freeze for 5s and return to Hypothermia Stack 2 after that. CD: 6s.Min activation SP: 80. SP consumption: 0-8s: 7 SP/s; 8-16s: 10 SP/s; after 16s: 15 SP/s. Max duration: 24s.",
        "evasion": "Phantom Dance",
        "evasionEffect": "Quickly evades enemy attack. Can be performed twice in a row.Immediately launch the 4th sequence of Basic ATK after Ultimate Evasion.Phantom Dance: Summons Crescent Harvest (summoned entity) on the attacker upon Ultimate Evasion, dealing 6 x 80% ATK of AOE Ice DMG and inflicting Hypothermia; CD: 20s.",
        "basic": "Cold Moon",
        "basicEffect": "5-sequence scythe attack.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 40% + 100% ATK of Physical DMG.3rd Sequence: 40% + 100% ATK of Physical DMG.4th Sequence: 2 x 60% + 160% ATK of Physical DMG; pulls in enemies within a small AOE.5th Sequence: 150% + 250% ATK of Physical DMG, summons Crescent Harvest (summoned entity) to unleash a hit dealing 150% ATK of Ice DMG.During the 5-sequence Basic ATK, tap the [ATK] immediately after Evasion to continue the sequence.",
        "name": "Argent Knight: Artemis"
    },
    "Azure Empyrea": {
        "character": "Fu Hua",
        "version": "3.7",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Fire DMG, Ignite, Time Mastery, Gather",
        "profile": "Close-range AOE support.Ultimate pulls in enemies and provides the Elemental Breach buff.",
        "leader": "Hex of Exposure",
        "leaderEffect": "All team members gain 14% Total DMG for 15.0s after entry. If the team consists of members of 3 different types, all team members gain 22% Total DMG.",
        "special": "Combo: Yin-Yang Tempo",
        "specialEffect": "When the sum of Yin and Yang reaches 3, hold [ATK] to unleash various Combo ATKs based on the numbers of Yin and Yang.3 Yang: Unleashes Senpo: Emperyan Fir, dealing 900% ATK of Fire DMG and additionally restores 4 SP upon hit.2 Yin + 1 Yang/1 Yin + 2 Yang: Unleashes Senpo: Snaring Flame, dealing 600% ATK of Fire DMG and pulling in enemies and immobilizing them for 3s; if this combo hits any target, all Valkyries on the battlefield restore 1 SP per second for 15s.3 Yin: Unleashes Senpo: Magma Melt, dealing 600% ATK of Fire DMG and boosting the team's All Elemental DMG against the target hit by this combo by 30% for 15s.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Empyrean Sunder",
        "ultimateEffect": "Pulls in enemies and deal damage.Immobilizes all enemies for 11s and deals 1,800% ATK of Fire DMG to them. Boosts the team's Elemental DMG against enemies hit by this skill by 30% for 15s, during which the deployed Valkyrie restores 1 SP per second, gains Ignore Interrupt and 35% Total DMG Reduction, while all enemies' Ignore Interrupt is lowered. The above effects do not stack with Combo ATK effects.Activation cost: 125 SP. CD: 5s.",
        "evasion": "Taichi of Inertia",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a rowWithin the first 1.2s after performing Ultimate Evasion, Valkyrie gains Ignore Interrupt, 80% Total DMG Reduction, and can directly perform the 4th sequence of Basic ATK (once only).Time Fracture: Ultimate Evasion triggers 3s of Time Fracture; CD 15s.Spirit Shield: Valkyrie gains a barrier that blocks the next incoming attack. Reset upon Ultimate Evasion.",
        "basic": "Yin and Yang",
        "basicEffect": "Tap the [ULT] or [ATK] button to attack enemies and gain Yin or Yang.The first 3 sequences: Each sequence deals 170% ATK of Fire DMG.4th sequence: Deals 200% ATK of Fire DMG.Tap [ATK]/[ULT] to unleash Solar Focus or Lunar Essence. The sum of Yin and Yang cannot not exceed 3; once this limit has been reached, Solar Focus or Lunar Essence can no longer be unleashed.",
        "name": "Azure Empyrea"
    },
    "Battle Storm": {
        "character": "Murata Himeko",
        "version": "1.8",
        "rank": "B",
        "type": "BIO",
        "core_strengths": "Physical, Heavy ATK, Stun, Time Mastery",
        "profile": "Mid-ranged anti-shield DPS.Good enemy suppressor.Gain high DMG reduction when using Charged ATKs.",
        "leader": "Stand By",
        "leaderEffect": "Team takes 16% less Melee Physical DMG.",
        "special": "Storm Assault",
        "specialEffect": "Attacks while dashing using sweeping strikes.Sprint ATK: Tap the [ATK] button while sprinting to attack enemies with sweeping strikes, dealing 450% ATK of Physical DMG to enemies in a large AOE.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Tornado Storm",
        "ultimateEffect": "Spins weapon to attack surrounding enemies.Deals 7 x 120% ATK of Physical DMG to surrounding enemies. Last hit deals 400% ATK of Physical DMG and knocks enemies airborne.Attracts nearby enemies when activated.SP Cost: 50.",
        "evasion": "Time Sprint",
        "evasionEffect": "Evasive roll. Can be triggered 2 times in a row.Zephyr: After Ultimate Evasion, gain 40% Move Speed for 3s.Time Fracture: Triggers Time Fracture upon Ultimate Evasion, slowing all enemies for 3s.CD: 15s.",
        "basic": "Charge: Heavy Sword",
        "basicEffect": "Basic ATK: Tap and hold the [ATK] button to initiate a 2-sequence charge. Tap the [ATK] button again after the 1st Sequence for a follow-up attack.Basic ATK: 180% + 250% ATK of Physical DMG.1st Charged Sequence: 400% + 630% ATK of Physical DMG.2nd Charged Sequence: 700% + 900% ATK of Physical DMG.Release the [ATK] button after 2nd charge sequence to unleash the hits automatically after 2s.",
        "name": "Battle Storm"
    },
    "Black Nucleus": {
        "character": "Bronya Zaychik",
        "version": "2.2.2",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Physical, Stun",
        "profile": "Close-ranged scattershot DPS.Many DMG buffs.Stealth mode: Stealth attack from behind to deal massive DMG.",
        "leader": "Complex Operations",
        "leaderEffect": "Shortens CDs of main effects triggered by whole team's Ultimate Evasion and Perfect Defense by 3.5s.",
        "special": "Switch: Mecha Smash",
        "specialEffect": "Switch skill unleashes a slam attack with robot arms.Slams enemies with robot arms, dealing 175% ATK of Physical DMG to enemies within the AOE.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Suppression Barrage",
        "ultimateEffect": "Unloads the entire arsenal to bombard the designated area.Suppression Barrage: Creates a small immobilizing field surrounding the target and bombards the AOE to deal 20 x 80% ATK of Physical DMG.SP Cost: 125.",
        "evasion": "Dimensional Interruption",
        "evasionEffect": "Dodges sideways to evade enemy attacks and becomes invisible.Dimensional Interruption: Enters 6s invisibility upon Ultimate Evasion. CD: 20s.Invisibility: Cannot be targeted by enemies; ignore all DMG taken when attacked; gain immunity against common debuffs; and greatly increased Move Speed and Attack Speed.Invisibility ends when tapping the [ATK] button, using weapon skills or Ultimates, or switching characters.",
        "basic": "Charge: Shrapnel Shell",
        "basicEffect": "Charged cannon fire. Higher charge sequence deals greater DMG.Arm Switch: Charging mode changes with type of equipped weapon.Guidance MOD: Equipping missile-type weapons transforms attacks to scatter shot shells. Each charge sequence increases the number of shells fired by 30%. Every shell deals a small AOE explosion. The 1st, 2nd, and 3rd charge sequences deal 50%, 60%, and 80% ATK of Physical DMG, respectively, and increases Interrupt.",
        "name": "Black Nucleus"
    },
    "Blazing Hope": {
        "character": "Asuka",
        "version": "4.5",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Time Mastery",
        "profile": "Melee Physical DMG dealer.Builds up energy to perform Charged ATK and deal massive damage.Ultimate boosts damage and enables finisher.",
        "leader": "Heart: Pure Again",
        "leaderEffect": "In the first 15s of battle, team deals 18.0% bonus Total DMG. Team Deals 20.0% bonus damage to shields if formed by 3 BIO battlesuits.",
        "special": "Charged: Chance!",
        "specialEffect": "Charge for a duration or longer to perform different attacks.Hold [ATK] to charge, during which Valkyrie takes 80% less Total DMG and has Iron Body.Short charge and long charge result in different attacks.Charged ATK I: Consume 100 Field Energy to charge forward dealing 4 x 100% ATK of Physical DMG.Charged ATK II: Consume 200 Field Energy to charge forward dealing 3 x 100% + 700% ATK of Physical DMG.In non-enhanced form, Charged ATK I restores 5 SP and Charged ATK II restores 15.Performing a Charged ATK grants a barrier that reduces Total DMG taken from the next hit by 50%.",
        "passive": "Say Goodbye Today",
        "passiveEffect": "Passive bonuses apply automatically.Field Energy: Maxes at 200.",
        "ultimate": "Thorny Lance Bloom",
        "ultimateEffect": "Enter enhanced form and enable different attack moves.1st Sequence: 3 x 70% ATK of Physical DMG.2st Sequence: 3 x 100% ATK of Physical DMG.3st Sequence: 400% ATK of Physical DMG.Charged ATK: Skip the charging to directly perform Charged ATK II dealing 3 x 200% + 800% ATK of Physical DMG.Finisher: Tap [ULT] again in enhanced form to hurl the lance up in the air. When it lands, the lance deals 1,500% + 15 x 50% + 500% ATK of Physical DMG and enhanced form ends.Entering enhanced form restores 200 Field Energy instantly and 30 Field Energy every second after until it ends.CD: 18s. SP cost: 100. Duration: 12s.",
        "evasion": "Eins Zwei Drei",
        "evasionEffect": "Evade enemy attacks up to twice in row.Ultimate Evasion triggers 3s of global Time Fracture. CD: 15s.Tap [ATK] after Ultimate Evasion to perform Ultimate Evasion ATK dealing 4 x 120% ATK of Physical DMG and restoring 60 Field Energy.",
        "basic": "Anta Baka?",
        "basicEffect": "Lance attacks.1st Sequence: 40% + 60% ATK of Physical DMG and 20 Field Energy regen.2nd Sequence: 50% + 50% ATK of Physical DMG and 20 Field Energy regen.3rd Sequence: 3 x 60% ATK of Physical DMG and 30 Field Energy regen.4th Sequence: 3 x 70% ATK of Lightning DMG and 30 Field Energy regen.5th Sequence: 300% ATK of Physical DMG and 30 Field Energy regen.",
        "name": "Blazing Hope"
    },
    "Blood Rose": {
        "character": "Murata Himeko",
        "version": "1.8",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Fire DMG, Ignite, Heavy ATK, Burst",
        "profile": "Melee Burst DPS.Gains SP by evading and attacking.Ultimate: Unparalleled destructiveness.",
        "leader": "Blood Waltz",
        "leaderEffect": "All team members' Charged ATKs deal 12% more Total DMG. If the team consists of members of 3 different types, all team members gain 12% Total DMG.",
        "special": "Blood Pirouette",
        "specialEffect": "During evasion, unleash a horizontal sweep attack at the enemy.Riposte: Tap the [ATK] button while evading to unleash a spinning slash, dealing 200.0% ATK of Physical DMG. CD: 5s.If the spinning slash hits the enemy, gain 5 SP to self.After spinning slash, tap the [ATK] button when the flashing circle appears on the character to directly unleash a charged attack.Sprint ATK: Tap the [ATK] button while sprinting to unleash a large AOE horizontal sweep that deals 400.0% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Blood Wrath",
        "ultimateEffect": "Activates burst mode: Blood Wrath which costs an increasing percentage of HP per second to maintain. Tap [ULT] again or switch out to end burst mode.Vehement Flame: Consumes 30 SP to enter burst mode. Tap the [ATK] button to unleash Charged ATKs.1st Sequence: 340% ATK of Physical + 310% ATK of Fire DMG;2nd Sequence: 260% ATK of Physical + 240% ATK of Fire DMG;3rd Sequence: 300% ATK of Physical + 250% ATK of Fire DMG; mid-air slash: 2 x 100% ATK of Physical DMG + 2 x 180% ATK of Fire DMG; Last Hit: 380% + 50% ATK of Physical DMG and 320% + 50% ATK of Fire DMG.Blood Philter: Blood Rose gains 40% Total DMG Reduction and immunity to stun, paralyze, and freeze.Cost: 30 SP to activate. Deals 200% ATK of AOE Fire DMG and ignites enemies for 6s.",
        "evasion": "Blood Bravura",
        "evasionEffect": "Sideways dodge to evade enemy attacks. Can be triggered 2 times in a row.Crimson Charge: Unleashes a Charged Combo instantly after Ultimate Evasion.Macropyre: Creates an explosion centered on the attacker, dealing 200% ATK of Fire DMG.CD: 15s.",
        "basic": "Charge: Blooded Claymore",
        "basicEffect": "Basic ATK: Uncharged: 3-sequence Zweihänder Fechten. Charging unleashes an empowered ATK sequence.Charged ATK Sequence: The 3-sequence attack is followed by an aerial Windmill Cleave with increased Ignore Interrupt during the attack.Basic ATK: 150% + 180% + 220% ATK of Physical DMG.Charged ATK: 250% + 160% + 200% ATK of Physical DMG.Windmill Cleave: 140% + 140% + 400% ATK of Physical DMG.",
        "name": "Blood Rose"
    },
    "Blueberry Blitz": {
        "character": "Liliya Olenyeva",
        "version": "3.1",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Freeze",
        "profile": "Close- to mid-range shieldbreaker DPS.Powerful DEF and retaliation skills.Buffs specific team mates.",
        "leader": "Vstavai!",
        "leaderEffect": "MECH and PSY-type battlesuits deal 10.0% more DMG to shields.",
        "special": "Charged ATK: Sturmovik",
        "specialEffect": "Perform a charged leap into the air for a Dive ATK.At max Blitz Power (BP), tap and hold the [ATK] button to spend all KE, aim at the attack site, and release the [ATK] button to unleash Diving Ilyusha.Diving Ilyusha: Deals 1,000% ATK of Physical DMG and knocks enemies airborne.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Blitz Power (BP): Starts battle with 1,000 BP (max) and recovers at 40 BP/s rate.First 3 sequences of Basic ATK restore 35 BP. 4th sequence and Ultimate Evasion restore 70 BP.",
        "ultimate": "We'll Bury You",
        "ultimateEffect": "Adopt a DEF stance to negate incoming attacks.Duration: 1.8s.When DEF Stance ends or when attacked during DEF Stance, Retaliation is triggered inflicting 550% + 400% ATK of Physical DMG and applies Weaken (deals 20% less DMG) to the enemy for 6s. If attacked immediately after taking DEF Stance, Retaliation EX is triggered, dealing 850% + 700% ATK of Physical DMG, proccing a brief Time Fracture and reducing Ultimate CD by 9s.CD: 15s. SP cost: 25.",
        "evasion": "Emergency Evasion",
        "evasionEffect": "Quickly evades enemy attack. Can be performed twice in a row.Ultimate Evasion: Generates an Iron Curtain that hits enemies in the AOE, dealing 50% ATK of Physical DMG per 0.5s and pulling them in for 3s. Base CD: 15s.",
        "basic": "Blitz Ataka",
        "basicEffect": "Swing that greatsword!1st Sequence: 150% ATK of Physical DMG.2nd Sequence: 150% ATK of Physical DMG.3rd Sequence: 150% + 3 x 100% ATK of Physical DMG.4th Sequence: 2 x 100% + 300% ATK of Physical DMG.",
        "name": "Blueberry Blitz"
    },
    "Bright Knight: Excelsis": {
        "character": "Durandal",
        "version": "3.9",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Physical, Heavy ATK, Time Mastery, Burst",
        "profile": "Melee Physical DMG dealer.Deal massive DMG with Charged ATK after Retaliation.Greatly gain DPS in Burst mode.Capable of controlling enemies with Throw.",
        "leader": "Horns of Jericho",
        "leaderEffect": "Grants 20.0% bonus Physical DMG and 20.0% bonus Crit DMG to the team.",
        "special": "Kontos Equites",
        "specialEffect": "Tap or hold [ATK] after certain moves to perform Charged ATKs.Hold [ATK] during the 5th sequence of Basic ATK or tap [ATK] after a successful Retaliation to perform Javelin or Javelin EX.Javelin deals 4 x 100% ATK of Physical DMG.Javelin EX deals 4 x 260% ATK of Physical DMG and pulls in enemies around the lance's landing point for 3s.The 4th sequence of Basic ATK can be performed right after Javelin or Javelin EX.In Burst mode, tap [ATK] upon a successful Retaliation to perform Phantom Blade or Phantom Cleave. Phantom Blade deals 650% ATK of Physical DMG. Phantom Cleave immediately pulls in all nearby enemies and then deals a total of 1,550% ATK of Physical DMG.Javelin EX and Phantom Cleave are triggered by Focus EX.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Paragon: Durandal stacks Paragon when taking damage, and every stack empowers her. 10 stacks max.",
        "ultimate": "Sceptum Regalis",
        "ultimateEffect": "Enter Burst mode and unlock the true potential of Bright Knight: Excelsis.1st sequence: 150% ATK of Physical DMG.2nd sequence: 180% + 200% ATK of Physical DMG.3rd sequence: 280% ATK of Physical DMG.4th sequence: 6 x 70% ATK of Physical DMG.5th sequence: 450% ATK of Physical DMG.Evade forward to deal 100% ATK of Physical DMG and enter Turbojet state, enabling Turbojet Assault, which deals 200% + 250% ATK of Physical DMG. The 3rd sequence of Basic ATK can be performed right after Turbojet Assault.When Focus EX in not in cooldown, hit an enemy upon entering Turbojet (forward evasion) to trigger Focus EX.Burst mode lasts 23s and costs 100 SP to activate, during which Durandal gains Iron Body. CD: 25s.Switching out will end Burst mode.",
        "evasion": "Scutum Divinitas",
        "evasionEffect": "Durandal adopts defense posture to block incoming attacks and retaliate.Tap [Evade] (non-directional) for Defense, during which incoming attacks trigger Retaliation, nullifying the attacks and returning 50% ATK of Physical DMG.Retaliation and Ultimate Evasion can both trigger Focus EX.Focus EX triggers brief Time Slow and enables Javelin EX or Phantom Cleave. CD: 10s. Minimum CD: 8s.",
        "basic": "Gladius Milites",
        "basicEffect": "Lance attacks.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 120% ATK of Physical DMG.3rd Sequence: 200% ATK of Physical DMG.4th Sequence: 4 x 100% ATK of Physical DMG.5th Sequence: 150% + 250% ATK of Physical DMG.",
        "name": "Bright Knight: Excelsis"
    },
    "Celestial Hymn": {
        "character": "Theresa Apocalypse",
        "version": "2.2.3",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Physical, Gather, Impair, Fast ATK",
        "profile": "Flexible mid-ranged DPS.Buffs Physical DPS of whole team.Multiple support skills to setup DPS spike.",
        "leader": "Sacred Arias",
        "leaderEffect": "Team gains 12.0% Max SP in battle. Teams with 3 BIO-type characters gain 20.0% Physical DMG.",
        "special": "Charged: Glorious Smite",
        "specialEffect": "Charge during the 5-sequence attack to unleash a spinning blade.Tap the [ATK] button to charge during a 5-sequence Basic ATK or Ultimate to unleash spinning blades after a short charge, dealing 4 x 20% ATK of Physical DMG to target and its surrounding enemies, and also impairing them, decreasing their DEF by 50% for 3s.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Celestial Judgment",
        "ultimateEffect": "Summons the Ultimate Blade Array, pulling in enemies to eviscerate them.When activated, creates a black hole lasting 3s, pulling enemies towards the center and slashing them with blades for an extended duration to deal 50 x 40% ATK of Physical DMG.SP Cost: 125.",
        "evasion": "Evangelist",
        "evasionEffect": "Quick sideways dodge to evade enemy attack. Can be triggered 2 times in a row.After Ultimate Evasion, tap the button within a short duration to directly unleash a charged attack.Blade Barrier: Equip the whole team with 1 stack of blade barrier, greatly increasing Ignore Interrupt, and causes 30% ATK of Physical DMG every 0.4s for 5s. CD: 20s.",
        "basic": "Celestial Gladius",
        "basicEffect": "Basic ATK: Mid-range 5-sequence attack with ethereal blades.1st Sequence: 3 x 40% ATK of Physical DMG.2nd Sequence: 3 x 40% ATK of Physical DMG.3rd Sequence: 4 x 40% ATK of Physical DMG.4th Sequence: 3 x 40% ATK of Physical DMG.5th Sequence: 5 x 45% ATK of Physical DMG.",
        "name": "Celestial Hymn"
    },
    "Crimson Impulse": {
        "character": "Raiden Mei",
        "version": "1.8",
        "rank": "B",
        "type": "BIO",
        "core_strengths": "Physical, Bleed, Burst, Time Mastery",
        "profile": "Melee DPS.Displacement skills.Stable small AOE DMG.",
        "leader": "Spirit of Loyalty",
        "leaderEffect": "When Combo Hit Count exceeds 20, team gains 10% Physical DMG.",
        "special": "Combo: Whirling Petals",
        "specialEffect": "Soaring whirlwind slash that knocks surrounding enemies airborne.Whirling Slash: 7 × 60% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Amaterasu",
        "ultimateEffect": "Activates Valkyrie SP burst to unleash a forward slash.Amaterasu: Deals up to 1,150% ATK of Physical DMG.SP Cost: 50",
        "evasion": "Phantom Blade",
        "evasionEffect": "Quickly dash to evade enemy attacks. Can be performed twice in a row.Time Fracture: Triggers upon an Ultimate Evasion and lasts 3s; CD: 15s.",
        "basic": "Gotamashiki",
        "basicEffect": "Swift penta-slash.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 120% ATK of Physical DMG.3rd Sequence: 75% ATK of Physical DMG.4th Sequence: 80% ATK of Physical DMG.5th Sequence: 250% ATK of AOE Physical DMG.",
        "name": "Crimson Impulse"
    },
    "Darkbolt Jonin": {
        "character": "Yae Sakura",
        "version": "3.6",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Lightning DMG, Paralyze, Time Mastery",
        "profile": "Close-range AOE DMG dealer.Gain Zakti energy to deal massive Lightning DMG.High mobile combat style.",
        "leader": "The Sahā World",
        "leaderEffect": "Team gains 23% Lightning DMG and 13% total DMG.",
        "special": "Combo: Naraka Finisher",
        "specialEffect": "Tap & hold [ATK] to strike a deadly blow.Tap & hold [ATK] to consume 100 Zakti and unleash Naraka Finisher.Naraka Finisher can be unleashed in quick succession, dealing 100% ATK of Lightning DMG against enemies within range.Naraka Finisher additionally restore 1.4 SP upon each hit.",
        "passive": "Eight Dukkha",
        "passiveEffect": "Passive bonuses apply automatically.Zakti: Starts at 0 and maxes at 500. Passive regen: 10 per second.",
        "ultimate": "Raksha's Rage",
        "ultimateEffect": "Raksha's Rage unleashes Rakshamaru's might to dominate the battlefield.Rakshamaru is summoned to smite enemies within a large AOE before her, dealing 300% + 80% + 6 x 30% ATK of AOE Lightning DMG.Tap [ULT] again within 12s since Rakshamaru's appearance to perform Samsara of Death, dealing 7 x 120% + 7 x 180% ATK of AOE Lightning DMG and paralyzing enemies for 4s upon hit.Samsara of Death boots Ignore Interrupt and grants 40% Total DMG Reduction for 12s.CD: 20s. The first activation costs 100 SP, while the second costs 0 SP.",
        "evasion": "Raijin's Blink",
        "evasionEffect": "Lightning imbued evasion.Ultimate Evasion triggers Raijin's Blink.Raijin's Blink: Creates a Lightning imbued shadow at the starting point; the shadows pulls in enemies and deals 50% ATK of Lightning DMG during its existence, and explodes after 3s to deal 400% ATK of Lightning DMG, triggering a global Time Fracture that lasts 3s.Once Raijin's Blink is triggered, Darkbolt Jonin enters Blink status for 5s, during which she stays invisible and can sprint; while sprinting, her Jonin Finisher can be cast by tapping [ATK] to deal 6 x 50% ATK of AOE Lightning DMG. Jonin Finisher restores 60 Zakti energy and has an extra 3 SP upon hit.CD: 15s.",
        "basic": "Garyu Stance",
        "basicEffect": "Melee moves that incorporate both kenjustsu and taijutsu.1st Sequence: 50% ATK of Physical DMG + 40% ATK of Lightning DMG. Restores 30 Zakti energy upon hit.2nd Sequence: 70% ATK of Physical DMG + 130% ATK of Lightning DMG. Restores 40 Zakti energy upon hit.3rd Sequence: 100% ATK of Physical DMG + 160% ATK of Lightning DMG. Restores 60 Zakti energy upon hit and an extra 3 SP upon hit.4th Sequence: 130% ATK of Physical DMG + 200% ATK of Lightning DMG. Restores 70 Zakti energy upon hit and an extra 5.5 SP upon hit.",
        "name": "Darkbolt Jonin"
    },
    "Dea Anchora": {
        "character": "Durandal",
        "version": "4.4",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Fire DMG, Ignite, Time Mastery, Gather",
        "profile": "Melee Fire DMG.Can connect Ultimates to deal insane damage.Deal more damage in Astral Harness.Can suppress enemies with Throws.",
        "leader": "Crux Galactica",
        "leaderEffect": "Team's Ultimate ATKs deal 18.0% bonus Total DMG. With 3 Fire DMG Valkyries, team deals 21.0% bonus Fire DMG.",
        "special": "Hercules the Warrior",
        "specialEffect": "Unleash the astral power within and enter Astral Harness to deal high burst damage.With over 200 Astrum, hold [ATK] to activate Astra Forge and enter Astral Harness, which costs 20 Astrum per second.After the 1st activation through Astra Forge, Astral Harness will later be activated through Cosmic Nova.Astra Forge and Cosmic Nova are both Charged ATKs which deal 800% ATK of Fire DMG and trigger a 2s global Time Fracture.",
        "passive": "Argo the Navigator",
        "passiveEffect": "Passive bonuses apply automatically.Astrum: Maxes at 200.In Astral Harness, Dea Anchora's Basic ATKs are permanently enhanced and she moves in DEA Astra state. In DEA Astra, tap [ATK] to connect into Astral Barrage. Forward evasions can be connected with DEA Astra faster.",
        "ultimate": "Sagittarius the Archer",
        "ultimateEffect": "Dea Anchora can perform different Ultimates.Melee mode: Astral Flares.Lance mode (3rd, 4th, 5th sequences of Basic ATK): Voidstar Anchor. Ultimates can be performed in cycle.Normal form: Costs 15 SP, restores 50 Astrum, and grants Iron Body.Astral Flares: Multiple punches dealing 1,000% ATK of Fire DMG.Voidstar Anchor: Leap up and hurl spears at enemies dealing 800% ATK of Fire DMG and gathering enemies for 2s.In Astral Harness: Costs 15 SP and grants invincibility. Astral Harness doesn't cost Astrum during Ultimate.Astral Flares EX: 1,280% ATK of Fire DMG.Voidstar Anchor EX: Hurl spears twice 720% ATK of Fire DMG and create 3 Ether Anchors to strike enemies dealing 3 x 80% ATK of Fire DMG.Cast Ultimate in Astral Harness twice in a row and tap [ULT] to cast Seirios Ballista: Unleash a star-shattering shot dealing 700% ATK of Fire DMG. Every SP consumed deals 60% ATK of bonus Fire DMG. SP cost caps at 35.Casting Seirios Ballista ends Astral Harness and resets Astrum.Ultimate ignites enemies hit dealing 30% ATK of Fire DMG per 0.5s and inflicting 3 [[Ignite Trauma]].",
        "evasion": "Pegasus the Fleet",
        "evasionEffect": "Quickly dodge enemy attacks up to twice in a row.Can be connected into Astral Barrage and deal 120% ATK of Fire DMG. Astral Barrage can be further connected into 2nd sequence of Basic ATK.Ultimate Evasion trigger Ultimate Evasion skill: Flight of Bellephoron, which triggers a 3s global Time Fracture and can be connected into Ultimate Evasion ATK to deal 600% ATK of Fire DMG. Ultimate Evasion ATK can be further connected into the 3rd sequence of Basic ATK. CD: 15s.",
        "basic": "Orion the Hunter",
        "basicEffect": "Use melee combat moves and dual lances to deal Physical & Fire DMG.Basic ATK:1st Sequence: 80% ATK of Physical DMG + 80% ATK of Fire DMG.2nd Sequence: 85% ATK of Physical DMG + 85% ATK of Fire DMG.3rd Sequence: 240% ATK of Fire DMG.4th Sequence: 350% ATK of Fire DMG.5th Sequence: 500% ATK of Fire DMG.Enhanced Basic ATK:3rd Sequence: 340% ATK of Fire DMG.4th Sequence: 520% ATK of Fire DMG.5th Sequence: 680% ATK of Fire DMG.",
        "name": "Dea Anchora"
    },
    "Dimension Breaker": {
        "character": "Bronya Zaychik",
        "version": "1.8",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Physical, Burst, Paralyze, Bleed, Time Mastery",
        "profile": "Stable mid-ranged DPS.Switch triggers small AOE Time Slow.Ultimate: Unleash Project Bunny to taunts enemies.",
        "leader": "Metal Gear",
        "leaderEffect": "Increases SP recovery by 25% for the team. Teams with 3 MECH-type characters gain 20% Total DMG Multiplier.",
        "special": "Switch: Dimension Pull",
        "specialEffect": "Switch skill immediately knocks target and all enemies in a small surrounding area airborne and inflicts Time Lock.Dimensional Razor: 100% ATK of Physical DMG and inflicts Time Lock for 4s.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Planes Walker: Become a Planes Walker after moving for 2s and significantly gains Move Speed.",
        "ultimate": "Project Bunny",
        "ultimateEffect": "Project Bunny activates autonomous attack protocols.Mech Frenzy: Consumes 100 SP to enter a 10s Burst mode, during which Project Bunny (summoned entity) is invincible and draws enemies towards it.Surplus Energy: Turns own attacks into laser attacks.Heat Reset: Heat meters of laser-type weapons will be reset upon burst mode activation.",
        "evasion": "Dimension Reduction",
        "evasionEffect": "Raises the shield to defend against frontal attacks.Counterstrike: Release the Defense button at the moment of the attack to unleash a counterstrike.Perfect Defense: Counterstrike knocks surrounding enemies airborne, paralyzing them and applying Time Lock for 4s and accelerating the character's Attack SPD by 30% for 3s. Perfect Defense base CD: 15s.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged Cannon ATK. Deals greater DMG at higher charge sequence.Arm Switch: Changes the way of charging based on the weapon equipped.Perfect Cooling: A CD circle will appear when laser weapons overheat. Tap [ATK] right before the circle shrinks to its smallest size to instantly reset the CD and greatly accelerate ATK Speed for a short duration.Within a short duration after activating Perfect Cooling, hitting a target with a laser will inflict a 4s Time Slow  on the target and nearby enemies.",
        "name": "Dimension Breaker"
    },
    "Disciplinary Perdition": {
        "character": "Aponia",
        "version": "5.7",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Lightning DMG, Time Mastery, Aerial",
        "profile": "Long-range Lightning DPS.Deal DMG in standby while in [Conviction] form.Combo ATKs and Ultimates deal massive DMG on the field.",
        "leader": "Discipline, Undefiable",
        "leaderEffect": "Increases the team's ranged Lightning DMG by 28% and the team's Total DMG by 12%.",
        "special": "Combo: Good and Evil, Absolute",
        "specialEffect": "In Conviction, teammates on the field deal Disciplinary Perdition's DMG.In Conviction, she prays for the Valkyries on the field, allowing Lightning DMG dealers to deal 135% Disciplinary Perdition's ATK of bonus Lightning DMG to all enemies (CD: 0.4s).At full Redemption, hold [ATK] to enter Predictor's Sentence, which reduces incoming Total DMG by 80% and summons Thunderstorms dealing 16 × 125% ATK of Lightning DMG in total to surrounding enemies. When Redemption falls to 0, she unleashes Inhibitor's Adjudication that deals 1850% ATK of Lightning DMG to all enemies and cancels Predictor's Sentence.",
        "passive": "This Life, Ascetic",
        "passiveEffect": "Passive bonuses apply automatically.Redemption, which caps at 200, can be recovered in many ways.Basic ATK SEQ 3/4 restores 10/25 Redemption on hit.By wielding the chakram as a ring, she has acquired the weapon active This Mind, Untainted.Without full Redemption, using weapon active sends her into Conviction.In Conviction, she recovers 5 Redemption (max: 200) per second, becomes invincible but unable to move or evade, and will stay on the field until charging is complete if switched out.Once Redemption reaches 200, she exits Conviction, and leaves and resets her switch CD if she is still on the field.",
        "ultimate": "This Sin, Inexorable",
        "ultimateEffect": "Aponia rises into the sky and delivers punishment to all enemies.Rain down destruction from above, dealing 14 × 180% + 1280% ATK of Lightning DMG to all enemies, during which all skill timers and the stage timer are paused.SP cost: 100. CD: 20s.",
        "evasion": "This Soma, Reincarnated",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a row.Ultimate Evasion Skill: Causes a 2.5s Global Time Fracture, unleashes Summoner's Promise that deals 3 × 300% ATK of Lightning DMG to all enemies, and restores 100 HP to the team. CD: 15s.",
        "basic": "Love and Hate, Discerned",
        "basicEffect": "Use the chakram as a ring to purge enemies.Basic ATK:1st Sequence: Deals 3 × 65% ATK of Lightning DMG.2nd Sequence: Deals 6 × 25% ATK of Lightning DMG.3rd Sequence: Deals 65% + 80% ATK of Lightning DMG.4th Sequence: Deals 250% ATK of Lightning DMG.In Conviction, hold [ATK] to call down lighting dealing 100% ATK of Lightning DMG. It is registered as Combo ATK and has a 0.35s CD.",
        "name": "Disciplinary Perdition"
    },
    "Divine Prayer": {
        "character": "Kiana Kaslana",
        "version": "1.8",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Heal, Impair, Burst, Time Mastery",
        "profile": "High melee DPS.Debuffs enemies.Effective team HP healer.",
        "leader": "Nebula Ward",
        "leaderEffect": "Team gains 20% Elemental DMG and takes 20% less Elemental DMG.",
        "special": "Combo: Star Arrow",
        "specialEffect": "Launches spin kick and charging kick attacks after 3 consecutive kicks.Spin Kick: 150% x 3 ATK of Physical DMG.Charging Kick: 200% ATK of Physical DMG and knocks enemies back.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses automatically apply.",
        "ultimate": "Valkyrie Refuge",
        "ultimateEffect": "Activate divine energy burst to enter Holy Light mode.Burst: Consumes SP continuously to increase ATK. Time Fracture is active throughout the Burst.Holy Light: Once the sub-skill is activated, heals HP for the entire team every 0.5s.At over 75 SP, consumes 20 SP to activate Ultimate and 10 SP/s afterwards. Duration: 60s or until SP is depleted, during which the SP consumption rate increases after 20s.",
        "evasion": "Time Fetter",
        "evasionEffect": "Quickly cartwheels away to evade enemy attacks. Can be performed twice in a row.Time Fetters: Triggers upon Ultimate Evasion. Knocks the attacker airborne and inflicts Time Lock for 4s. CD: 8s.",
        "basic": "Meteor Kata",
        "basicEffect": "4-kick attack sequence.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 100% ATK of Physical DMG.3rd Sequence: 100% ATK of Physical DMG.4th Sequence: 300% ATK of AOE Physical DMG.",
        "name": "Divine Prayer"
    },
    "Fallen Rosemary": {
        "character": "Rita Rossweisse",
        "version": "4.2",
        "rank": "S",
        "type": "QUA",
        "core_strengths": "Lightning DMG, Paralyze, Time Mastery, Gather",
        "profile": "Sustained melee AoE damage.Apply Runes to enhance self and team.Charged ATK and Ultimate deal high damage.",
        "leader": "Tonight or Never",
        "leaderEffect": "Team deals 18.0% bonus Total DMG if formed by battlesuits of 3 different types. For the team, Combo, Charged ATKs, and Ultimates deal 12.0% bonus Lightning DMG.",
        "special": "God Eater",
        "specialEffect": "Valfreyja Form enabled more powerful Charged ATKs.At 100 Disir, hold [ATK] to cast God Hunter.At 200 Disir, hold [ATK] to cast God Devourer.God Hunter: Conjure Garmr to attack enemies nearby, dealing 600% ATK of Lightning DMG.God Devourer: Garmr creates Stain of Trickery, making enemies in range take 18% bonus Lightning DMG for 20s.Casting God Eater grants temporary invincibility, gathers enemies nearby, and resets Valfreyja Form duration.",
        "passive": "Unbound Flyting",
        "passiveEffect": "Passive bonuses apply automatically.Fallen Rosemary can charge her strength on standby when her teammates are fighting.",
        "ultimate": "Helvegr",
        "ultimateEffect": "Lift the Trickster's seal for a mighty blow.Unleash the Trickster sealed within the lantern. After a short channeling, the Tickerster unleashes a powerful AOE attack, dealing 1,200% ATK of Lightning DMG, triggering a 1s global Time Fracture, and inflicting Quantum Implosion on QUA enemies.SP cost: 100. CD: 20s.",
        "evasion": "Night Seeress",
        "evasionEffect": "Quickly evades enemy attack. Can be performed twice in a row.Evasions deal 2 x 40% ATK of Lightning DMG and conjure Strick in Valfreyja Form.Evasion ATKs conjure Strix to strike on hit, dealing 6 x 50% ATK of Lightning DMG with Paralyze Trauma and siphoning 24 Disir in total. Strix needs 8s to recharge for the next strike.Ultimate Evasions trigger Night Seeress, which creates a 3s global Time Fracture, fully recharges Strix, and conjures Strix to strike enemies with lightning (Strix enters recharging afterwards). CD: 15s.Upon Ultimate Evasion or when Strix is fully recharged in Valfreyja Form, Evasion ATKs can be connected into Basic ATK 4th sequence on hit.",
        "basic": "Vaettir Mistress",
        "basicEffect": "Attack with the scythe and siphon enemy souls to enhance self.1st Sequence: 30% ATK of Physical DMG + 40% ATK of Lightning DMG and 3 Disir regen on hit.2nd Sequence: 90% ATK of Physical DMG + 90% ATK of Lightning DMG and 9 Disir regen in total on hit.3rd Sequence: 80% ATK of Physical DMG + 105% ATK of Lightning DMG and 8 Disir regen in total on hit.4th Sequence: 120% ATK of Lightning DMG and 28 Disir regen in total on hit.5th Sequence: 160% ATK of Physical DMG + 170% ATK of Lightning DMG and 12 Disir regen in total on hit.At 100 Disir, hold [ATK] to consume 100 Disir, perform Charged ATK dealing 400% ATK of Lightning DMG, and enter Valfreyja Form. In Valfreyja Form, basic ATK 3rd sequence conjures Garmr to attack dealing 350% ATK of Lightning DMG with Paralyze Trauma and restoring 10 Disir on hit.4th sequence conjures Linnorm to attack dealing 420% ATK of Lightning DMG with Paralyze Trauma, and restoring 40 Disir in total on hit.",
        "name": "Fallen Rosemary"
    },
    "Flame Sakitama": {
        "character": "Yae Sakura",
        "version": "2.2.3",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Fire DMG, Ignite, Time Mastery",
        "profile": "Melee DPS.Deals Fire DMG at specific timing.High sustainability.",
        "leader": "Eternal Cycle",
        "leaderEffect": "Team gains 25% DEF in battle. BIO-type characters gain 6% Max HP.",
        "special": "Combo: Firewind",
        "specialEffect": "Leaping Slash ATK with both blades drawn.Combo Slash: 150% ATK of Physical DMG.Combo Follow-up ATK: Pause tapping [ATK] after Combo ATK and tap [ATK] again when the circle appears.Combo Follow-up ATK deals 220% ATK of Fire DMG and ignites enemies hit to deal 50 Fire DMG per 10s.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.After certain moves (4th hit of Basic ATK or Combo ATK), tap the [ATK] button when a flashing circle appears on the character to trigger follow-up attacks, dealing massive Fire DMG.",
        "ultimate": "Yae's Inferno",
        "ultimateEffect": "Attacks a random enemy multiple times and inflicts Time Lock to enemies within a large AOE.Guren Lotus: Attacks a random enemy 8 times, with each time dealing 200% ATK of Fire DMG.Karmic Flame: 400% ATK of Fire DMG to enemies in a large area and inflicts Time Slow for 4.5s.Blazing Tempo: Empowers character from Iron Body and faster attack for 9s. Follow-up attacks can be triggered without having to tap the [ATK] button at the precise time.",
        "evasion": "Blazing Dance",
        "evasionEffect": "Quickly cartwheels away to evade enemy attacks.Time Fracture: Triggers Time Fracture upon an Ultimate Evasion, slowing all enemies for 3s. CD: 15s.",
        "basic": "Ryuka Blade",
        "basicEffect": "Quick 5-sequence slash. Evading during the first 3 sequence will not break the sequence.1st to 3rd Sequences: 100% + 100% + 150% ATK of Physical DMG.4th Sequence: 150% ATK of Physical DMG.5th Sequence: 150% ATK of Physical DMG.Basic Follow-up ATK: After the 4th Sequence, wait for a flashing circle to appear and then immediately tap [ATK].Basic Follow-up ATK deals 650% ATK of Fire DMG and Ignites the target to further deal 50 Fire DMG per 0.5s for 10s.",
        "name": "Flame Sakitama"
    },
    "Golden Diva": {
        "character": "Eden",
        "version": "5.7",
        "rank": "A",
        "type": "IMG",
        "core_strengths": "Lightning DMG, Time Mastery, Paralyze",
        "profile": "Long-range Lightning DPS.Can inflict Paralyze Trauma and make team Paralyze more effective.Restore team SP.",
        "leader": "This Moment Shines Like Gold",
        "leaderEffect": "Leader Bonus Leader Skill: Increases the team's Lightning DMG by 7.5% and the team's Total DMG by 6.3%.",
        "special": "Combo ATK: Romance: Paradise",
        "specialEffect": "When Score meets different conditions, hold [ATK] to cast different Combo ATKs.Chord: Fire rapidly, dealing 5 × 130% ATK of Lightning DMG. Casting it makes the caster enter Performance.Variation: Throw a note bomb, dealing 400% ATK of Lightning DMG. Casting it makes the team enter Fascination.Ensemble: Hurl pistols, which can spin twice. The first spin deals 200% + 6 × 80% ATK of Lightning DMG and consumes 6 notes. The second spin deals 6 × 25% ATK of Lightning DMG in total. Casting it makes the caster enter Symphony and Performance and the team enter Fascination. Release [ATK] during the second spin to retrieve the pistols.During Chord and Variation, gain Iron Body and 30% Total DMG Reduction. During Ensemble, become immune to incoming DMG.",
        "passive": "Requiem: Remembrance",
        "passiveEffect": "Passive bonuses apply automatically.Score: Separated into 2 bars that each holds 3 notes. Using Basic ATK restores 1 note. At 3 notes, use Combo ATK to finish the bar.After finishing 2 bars, use Combo ATK to consume all notes. Consuming a note restores 100 HP.",
        "ultimate": "Fantasy: Century",
        "ultimateEffect": "Expand a domain and strengthen herself.Pluck strings to play Century Chapter for 15s, dealing 1800% ATK of AoE Lightning DMG, inflicting 12 [[Paralyze Trauma]], and granting Sound of Nature, which makes skill animations negate incoming DMG for 15s. She can move freely while Century Chapter is playing. Upon gaining Sound of Nature, recover all notes and finish all bars. While the buff lasts, auto-recover notes, and tapping [ATK] unleashes Combo ATKs Ensemble (pistols only spin once), Chord, and Variation in order. Score resets when the buff expires.SP cost: 125. CD: 17s.",
        "evasion": "Waltz: Dream",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a row.Ultimate Evasion causes a 3s Global Time Fracture (CD: 15s).",
        "basic": "Caprice: Starlight",
        "basicEffect": "Fire dual pistols.1st Sequence: 90% ATK of Lightning DMG.2nd Sequence: 100% ATK of Lightning DMG.3rd Sequence: 120% ATK of Lightning DMG.Using Basic ATK restores 1 note.",
        "name": "Golden Diva"
    },
    "Goushinnso Memento": {
        "character": "Yae Sakura",
        "version": "2.0",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Ice DMG, Freeze",
        "profile": "Mid-ranged DPS.Stores charge to deal AOE Ice DMG.Ultimate: DPS Boost and restores charge.",
        "leader": "Sakura Dance",
        "leaderEffect": "All characters in the team gain 17% Crit Rate at above 80% HP.MECH-type battlesuits: Gain 30% All Elemental DMG.",
        "special": "Combo: Instant Draw",
        "specialEffect": "High speed battou slash.Consumes 200 kinetic energy to unleash Zankeki ULTRA and inflict minor Rime Trauma.Kinetic energy caps at 1,000 and slowly regenerates when the Valkyrie is deployed.Zankeki: 50% ATK of Physical DMG.Zankeki ULTRA: 100% ATK of Physical DMG + 200% ATK of Ice DMG.Assault: 100% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Frigid Rave",
        "ultimateEffect": "Instant battou slash against enemies in front.Icewind: Total of 900% ATK of Ice DMG, with the last hit freezing the target.Execute: Shatters the ice to deal 1,200% ATK of Physical DMG.Energy Charge: Gains 250 KE upon unleashing Ultimate, and gains 30 KE per 0.25s for 10s when Ultimate ends.SP Cost: 125.",
        "evasion": "Clone Step",
        "evasionEffect": "Quick dash to evade enemy attacks.White Shadow: A White Shadow (summoned entity) emerges upon Ultimate Evasion and explodes after 1s, dealing 200% ATK of Ice DMG to surrounding enemies (damage source:self). CD: 15s.",
        "basic": "Kansakura",
        "basicEffect": "Swift 5-sequence slash, with each sequence restoring 60 Kinetic Energy (KE) upon hit. Evading during the first 4 sequences does not interrupt the sequence connection.1st Sequence: 50% ATK of Physical DMG.2nd Sequence: 80% ATK of Physical DMG.3rd Sequence: 120% ATK of Physical DMG.4th Sequence: 120% ATK of Physical DMG.5th Sequence: 250% ATK of Ice DMG.",
        "name": "Goushinnso Memento"
    },
    "Gyakushinn Miko": {
        "character": "Yae Sakura",
        "version": "2.0",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Bleed, Burst",
        "profile": "Melee DPS.Marks targets to deal DMG spikes.Can swiftly shuttle between enemies.",
        "leader": "Heart of Prajna",
        "leaderEffect": "When Combo Hit Count exceeds 20, team gains 12% Physical DMG.",
        "special": "Combo: Shunmetsu",
        "specialEffect": "Penetrates enemy with a charged One Flash, dealing damage.One Flash: 100% ATK of Physical DMG.One Flash consumes Sakura Brands from enemies upon hit and unleashes One Slash, dealing 400% ATK of Physical DMG and knocking them airborne.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Sakura Brand: Clears the Sakura Count on enemy once the count has reached 3 and inflicts a Sakura Brand. The Sakura Brand lasts for 10s.",
        "ultimate": "Crimson Naraka",
        "ultimateEffect": "Trigger Valkyrie burst to augment attack mode and gain Ignore Interrupt.Burst deals 50% ATK of DMG and inflicts a Sakura Brand onto enemy.After activation, Basic ATKs turn into One Flash. Hitting an enemy with this One Flash adds 1 Sakura Count. Duration: 10s.SP Cost: 100.",
        "evasion": "Shuryu Slash",
        "evasionEffect": "Quick dash to evade enemy attacks.Ultimate Evasion: Generates a 3-sequence sword aura, each hit dealing 10% ATK of Physical DMG to surrounding enemies.Shuryu Slash: Each sword aura hit adds a Sakura count onto the target upon Ultimate Evasion. CD: 15s.",
        "basic": "Sakuraoti",
        "basicEffect": "Switch 6-sequence slash attack.1st Sequence: 50% ATK of DMG.2nd Sequence: 70% ATK of DMG.3rd Sequence: 100% ATK of DMG.4th Sequence: 120% ATK of DMG.5th Sequence: 120% ATK of DMG.6th Sequence: 150% ATK of DMG.The 3rd and 5th sequences of the Basic ATK adds 1 Sakura Count to the target.",
        "name": "Gyakushinn Miko"
    },
    "Haxxor Bunny": {
        "character": "Bronya Zaychik",
        "version": "4.7",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Ice DMG, Time Mastery, Fast ATK",
        "profile": "Mid-range sustained DMG dealer.Launches QTE on standby to support teammates.Summon drones to attack frequently.",
        "leader": "H-T-T-P-S",
        "leaderEffect": "Team deals 17.0% more Ice DMG through Ultimates or in Burst modes. For every Ice DMG dealer on he team, team gains 1.0% total DMG.",
        "special": "Charged: Tempest Sniper",
        "specialEffect": "Hold [ATK] to unleash powerful cannon attacks.At full KE, hold [ATK] to consume all KE and unleash powerful attacks based on weapon type, dealing 120 x 6% ATK of Ice DMG.Charged ATK can also lock the current target for the drones to perform a special ATK.",
        "passive": "Trackers",
        "passiveEffect": "Passive bonuses apply automatically.Kinetic Energy: Maxes at 200. Every hit of Basic ATK restores 5 KE.Haxxor Count: Maxes at 20.Drones: Bronie summons a drone (summoned entity) to aid in battle. Drones last for 30s and have 2 attack patterns.Basic ATK: Mini gun attacks which deal 50% ATK of Ice DMG every hit. Every bullet fired restores 1 Haxxor Count with a 1s CD. Each drone fires one round every second and every round has 3 bullets.Special ATK: Based on Bronie's weapon type. Deals 240% ATK of Ice DMG.Drones prioritize the nearest enemy. Each drone present boosts Total DMG from Valkyries or summoned entities by 2.5%. Up to 2 can be present. Summoning when where are 2 drones present extends their duration by 10s. At the end of the duration, drones dive towards the target to self-destruct and deal 100% ATK of Ice DMG.",
        "ultimate": "Star Destroyer",
        "ultimateEffect": "Unleash mass bombing upon enemies in front of Haxxor Bunny.Tap [ULT] to channel for a short duration and unleash carpet-bombing upon enemies in front of Haxxor Bunny for 7s dealing 60 x 30% ATK of Ice DMG.For 16s after Ultimate activation, drones are enhanced and they can switch to Haxxor Bunny's current target at any time. In addition, they perform a special attack every 3s and trigger Synchronized Array, but this effect cannot be triggered by teammates within the duration.Activation SP Cost: 125. CD: 25s.",
        "evasion": "Parting Gift",
        "evasionEffect": "Step sideways to dodge attacks. Can be performed twice in a row.Ultimate Evasion drops a grenade which detonates after a 1s delay, shortly gathers nearby enemies, procs a 4s global Time Fracture, and deal 200% ATK of Ice DMG.CD: 15s. Tap [ATK] after Ultimate Evasion to connect into the 3rd sequence of Basic ATK.",
        "basic": "Hare Hunters",
        "basicEffect": "Use submachine guns to shoot. Evasion enables the next sequence.1st Sequence: 25% x 4 of Ice DMG.2nd Sequence: 25% x 4 ATK of Ice DMG.3rd Sequence: 15% x 8 ATK of Ice DMG.4th Sequence: 30% x 9 ATK of Ice DMG.",
        "name": "Haxxor Bunny"
    },
    "Herrscher of Flamescion": {
        "character": "Kiana Kaslana",
        "version": "5.0",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Fire DMG, Time Mastery, Heal, Gather, Aerial",
        "profile": "Melee Fire DPS.Capable of aerial combat.Turns into Herrscher form for DPS spike.",
        "leader": "Nameless Knight-Errant's Path",
        "leaderEffect": "Team deals 34.0% bonus Elemental DMG. Every non-Kiana battlesuit grants 25.0 bonus initial SP to the team (50.0 max; can only be triggered once every 10 minutes in Open World).",
        "special": "Blazing Chariot's Trail",
        "specialEffect": "Launch power attacks at 0 Heat.Heat: Starts at 0. Reduced by 21 per second when not in Overheat and by 10 per second when in Overheat.Base form Combo ATK: Increase 45 Heat and consume 15% of current HP to deal 300% ATK of Fire DMG, trigger 2.5s of global Time Fracture, and enter Herrscher form lasting 11.5s.In Herrscher form, Valkyrie has different moves, higher Ignore Interrupt, and loses 1% of current HP per second.Herrscher form Combo ATK: Increase 100 Heat and trigger 3.5s of global Time Fracture.Ground: 1,200% ATK of Fire DMG.Airborne: Knock enemies airborne and create a black hole gathering enemies and dealing 1,200% ATK of Fire DMG.Valkyrie enters Overheat when Herrscher form ends and Heat increases by 100. Switching out ends Herrscher form.",
        "passive": "Fiery Hymn's Pledge",
        "passiveEffect": "Passive bonuses apply automatically.Valkyrie's Basic/Combo ATKs and Charged/Combo ATKs from teammates inflict Ember Brand lasting 6s on enemies. Ember Brand inflicted in Herrscher form deals Fire DMG equal to 5% of Valkyrie's ATK per 0.5s. 10 stacks max.The following attacks can detonate Ember Brand on enemies in a large area (without consuming it) to deal 120% ATK of Fire DMG: Last sequence of Herrscher form Basic ATK (CD: 2s), QTE, last sequence of base form ground Basic ATK, and Combo ATK.When in Overheat, Heat drops by 15 every 2s.",
        "ultimate": "The Blade Supreme, Rekindled",
        "ultimateEffect": "Launch a powerful attack.Deal 2,150% ATK of Fire DMG during which Valkyrie is in Herrscher form and all skill timers on her, enemies as well as the stage timer are paused. If cast in Herrscher form, Ultimate will end Herrscher form after the cast.Activation cost: 75 SP. CD: 16s.",
        "evasion": "Lone Phoenix's Plume",
        "evasionEffect": "Quickly evade enemy attacks.Ultimate Evasion triggers 4s of global Time Fracture. CD: 18s.Ground:Evasion can be performed twice in a row.Airborne:Base form: Evasion can only be performed once.Herrscher form: No limitations on evasions.Tap [ATK] after evasion to connect into Basic ATK Sequence 3.In Herrscher form, Ultimate Evasion inflicts 5 stacks of Ember Brand on enemies in a large area and restores 2 SP. CD: 10s.",
        "basic": "Tempered Warrior's Strike",
        "basicEffect": "Greatsword attacks.Ground:Base form: 730% ATK of Fire DMG.Herrscher form: 970% ATK of Fire DMG.Airborne:Base form: 490% ATK of Fire DMG.Herrscher form: 900% ATK of Fire DMG.Upward Slash: 200% ATK of Fire DMG.Downward Slam: 30% + 90% x 2 ATK of Fire DMG.",
        "name": "Herrscher of Flamescion"
    },
    "Herrscher of Reason": {
        "character": "Bronya Zaychik",
        "version": "3.3",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Ice DMG, Freeze, Burst, Time Mastery",
        "profile": "Melee. Gathers Konstruktyom.Can unleash multiple Charged ATKs to deal heavy Ranged DMG.Ultimate: USAGI Kinetik heavy bike that deals massive DMG.",
        "leader": "Source Protocol",
        "leaderEffect": "Team gains 30.0% to all Elemental DMG. Any Bronya, Seele, or Olenyevas in the team also gains 25.0% Total DMG Multiplier.",
        "special": "Charged: Weaponized Build",
        "specialEffect": "Perform Charged ATK during Basic ATK sequence or evasion. Tap and hold [ATK] button to spend 120 Konstruktyom to turn into the DEA Raison Herrscher Form. DEA Raison: Tap [ATK] to unleash Charged ATKs.Armament Build: Charged ATK mode differs according to weapon type, but deals a total 660% ATK of Ice DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Konstruktyom: Maxed at 480.Analyzed: A debuff. Analyzed enemies are frozen for 1.5s. Bronya gains 40% Total DMG Multiplier against Analyzed / Frozen enemies.Exit: DEA Raison ends. Bunny reverts to Armored Bunny state.",
        "ultimate": "Cyberangel.cfg",
        "ultimateEffect": "Burst transform of Project BunnyGains 480 Konstruktyom and deals 5 x 450% + 800% ATK of Ice DMG, then ride USAGI Kinetik as DEA Raison. Max duration: 17s.USAGI Kinetik: Gains 40 Konstruktyom per second. While moving, creates a Hover Gun per 0.6s that deals 4 x 65% ATK of Ice DMG.Tap [ATK]: Uses 240 Konstruktyom to perform Charged ATK and deal 2 x 250% + 2 x 300% ATK of Ice DMG and inflicts a 4s Analyzed debuff.Tap [Evade]: Enemies hit by evasion move take up to 4 x 10% ATK of Ice DMG and receive an Analyzed debuff for 4s.CD: 30s. SP cost: 125.",
        "evasion": "Instant Freeze",
        "evasionEffect": "Quickly evades enemy attacks.Ultimate Evasion: +120 Konstruktyom, and next ATK inflicts a 4s Analyzed debuff to the enemy.Instant Freeze: Ultimate Evasion generates 3s Time Fracture. CD: 15s.",
        "basic": "Zeroth Drive",
        "basicEffect": "4-sequence attack.1st Sequence: 100% ATK of Physical DMG + 80% ATK of Ice DMG.2nd Sequence: 100% ATK of Physical DMG + 100% ATK of Ice DMG +25 Konstruktyom.3rd Sequence: 150% + 150% ATK of Physical DMG + 2 x 100% ATK of Ice DMG +25 Konstruktyom.4th Sequence: Drills deal 8 x 40% + 200 ATK of Ice DMG. + 9 x 25 Konstruktyom. Pulls in nearby enemies.",
        "name": "Herrscher of Reason"
    },
    "Herrscher of Sentience": {
        "character": "Fu Hua",
        "version": "4.6",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Physical, Impair, Time Mastery, Gather, Burst",
        "profile": "Physical support.Can gather and impair enemies.Performs combo slashes after activating Ultimate to deal high DMG.",
        "leader": "Alliteration is an Agony",
        "leaderEffect": "Team deals 26% Crit DMG in burst mode. For every BIO battlesuit on the team, team has 4% bonus Crit Rate.",
        "special": "Combo: Transcendence of Trinity",
        "specialEffect": "Hold [ATK] to perform enhanced attacks.Consume full kinetic energy of the current weapon to perform Combo ATK.Sword: Gather and Time-Lock enemies to smite them dealing 1,390 ATK of Physical DMG.Spear: Hurl the spear to gather and strike enemies before blinking over to follow up dealing 820% ATK of Physical DMG.Chain blades: Launch AOE attacks dealing 850% ATK of Physical DMG and inflicting 1.2s of coma on enemies.",
        "passive": "Ace Arsenal",
        "passiveEffect": "Passive bonuses apply automatically.Every weapon has an independent gauge of kinetic energy that starts at 300 and maxes at 300. Recovery:The weapon in use restores 3 points every 0.1s.Weapons not in use restore 1 point every 0.1s.Sword & spear: Every hit of Basic ATK restores 9 points.Chain blades: every hit of Basic ATK restores 12 points.All weapons restore 300 points when Herrscher form ends.Certain attacks inflict coma on enemies. Enemies in a coma are immobilized and take 200% ATK of Physical DMG when the coma ends.",
        "ultimate": "A Worldful of Woes",
        "ultimateEffect": "Enter Herrscher form and use the weapon case to attack.Hold [ULT] to enter Herrscher form, create an illusive space, and launch spiritual attacks on enemies in a large area, dealing 1,800% ATK of Physical DMG. This attack has 40% bonus Crit Rate and temporarily suspends all skill timers (for self and enemies) and the stage timer.In Herrscher form (burst mode), all enemies are impaired and have 75% less DEF, while Valkyrie has improved Ignore Interrupt and 40% Total DMG Reduction for 15s.Tap [ATK] repeatedly to perform a 3-sequence combo dealing 1,120% ATK of Physical DMG.Hold [ATK] to perform Combo ATK: Slashes dealing N x 105% + (800% + N x 50%) ATK of Physical DMG. Spam or hold [ATK] to increase slashes (max: 10). Every slash boosts self Total DMG by 2% until the Combo ATK ends.Tap [ULT] to launch special ATK: Illusive Cataclysm, gathering enemies in a large area and dealing 350% ATK of Physical DMG. CD: 8s. The cataclysm lasts until the end of Herrscher form and enemies on it will not be knocked back.SP cost: 125.",
        "evasion": "A Wraith without Trace",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a row.Ultimate Evasion triggers 2.5s of global Time Fracture. Base CD: 20s. Minimum CD: 16s.Evasions create an Illusion: Hit Me! lasting 3s which taunts enemies and explodes when hit or expired. The explosion deals 400% ATK of Physical DMG and procs Ultimate Evasion skill on hit. Only one illusion can exist and they cannot be created while Ultimate Evasion skill is in cooldown.In non-Herrscher form, Valkyrie begins sword riding after running for a duration and deals 50% ATK of Physical DMG per 0.5s to enemies nearby. Weapon switch ATKs are disabled while sword riding. Tap [ATK] to deal 150% ATK of Physical DMG and end sword riding.",
        "basic": "Trial of Trinity",
        "basicEffect": "Use the sword/spear/chain blades to attack.Sword: 4 sequences dealing 810% ATK of Physical DMG.Spear: 5 sequences dealing 775% ATK of Physical DMG. The 2nd & 5th sequences gather enemies.Chain blades: 3 sequences dealing 750% ATK of Physical DMG.Tap [ULT] to switch weapon and perform weapon switch attack.Sword to spear: Connect into the 2nd sequence of spear Basic ATK.Spear to chain blades: 160% ATK of Physical DMG.Chain blades to sword: 160% ATK of Physical DMG.",
        "name": "Herrscher of Sentience"
    },
    "Herrscher of the Void": {
        "character": "Kiana Kaslana",
        "version": "2.7",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Physical, Time Mastery, Fast ATK, Aerial",
        "profile": "Stable ranged AOE DPS.Can evade through enemies.Herrscher Form provides DPS spike.",
        "leader": "Void Throne",
        "leaderEffect": "Team gains 30% Crit DMG and 10% Crit Rate.",
        "special": "Charge: Time Tremor",
        "specialEffect": "With at least 240 Herrscher Charge, tap and hold the [ATK] button during the 5-sequence Basic ATK to unleash Charged ATK (snap her fingers).Herrscher Charge maxes at 480. Each Space Core summoned recovers 60 Herrscher Charge. Charged attack: Temporary Time Prison to the target and deals 600% ATK of Large AOE Physical DMG, and activates Herrscher Form.Full Herrscher Charge: Deal an extra 400% ATK of Extra-large AOE Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Herrscher Form: Consumes 24 Herrscher Charge every 0.5s. Can move rapidly during attack. Can perform 2 consecutive evasions. Slightly gains Interrupt and Ignore Interrupt. The AOE of Space Core explosion extends.Basic ATK under Herrscher Form becomes a 3-sequence ATK:1st Sequence: 3 x50% ATK of Physical DMG.2nd Sequence: 4 x 50% ATK of Physical DMG.3rd Sequence: Inflicts short Time Prison on the target; explosion epicenter pulls in enemies within a small AOE, dealing 80% + 6 x 50% ATK of large AOE Physical DMG and summoning a Space Core at the enemy's position.",
        "ultimate": "Void Unleashed",
        "ultimateEffect": "Tears open the space-time fabric to unleash a barrage of raw energy.Deals 9-12 hits in a large AOE in front of the character, each hit dealing 300% ATK of Physical DMG and applies Time Lock to enemies within a large AOE around the character for 3s.SP cost: 125.",
        "evasion": "Phase Shuttle",
        "evasionEffect": "Shuttle through the space-time fabric to evade enemy attacks.Ultimate Evasion summons a Space Core and triggers a local Time Slow, stopping enemy action within the AOE for 3s. CD: 20s.After evasion, tap the [Attack] button within a short time period to deal the 3rd strike of the 5th Basic ATK sequence.",
        "basic": "Subspace Lance",
        "basicEffect": "Rapid 5-sequence attack.1st Sequence: 60% ATK of Physical DMG.2nd Sequence: 2 x 40% ATK of Physical DMG.3rd Sequence: Small AOE 150% ATK of Physical DMG, and summons a Space Core (summoned entity) at the enemy's position.4th Sequence: 3 x 40% ATK of Physical DMG.5th Sequence: Inflicts short Time Prison on the target enemy. Explosion epicenter pulls in enemies in small AOE. Deals 80% + 6 x 40% ATK of Large AOE Physical DMG and summons a Space Core at the enemy's position.Space Core explodes after being summoned, dealing 100% ATK of Physical DMG (DMG calculations based on Herrscher of the Void's stats).",
        "name": "Herrscher of the Void"
    },
    "Herrscher of Thunder": {
        "character": "Raiden Mei",
        "version": "4.1",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Lightning DMG, Paralyze, Fast ATK, Burst, Time Mastery",
        "profile": "Melee damage dealer.Sustained high Lightning DMG.Bonus SP for PSY teammates.",
        "leader": "Yaoyorozu",
        "leaderEffect": "Team deals 14.0% bonus Total DMG. PSY-Type battlesuits have 50 bonus initial SP. In Open World, the initial SP bonus takes effect once every 10 mins.",
        "special": "Combo: Susanoo's Frenzy",
        "specialEffect": "Unleash Herrscher power for a mighty blow.Hold [ATK] after Basic ATK to perform.Combo ATK: 200% ATK of Lightning DMG.At full Herrscher Charge, hold [ATK] after Basic or Combo ATK to consume all charge and perform special Combo ATK - Shinzan Strike, dealing 1,050% ATK of Lightning DMG and triggering 3s of Narukami's Mark's Falling Thunder effect.",
        "passive": "Kagutsuchi's Avatar",
        "passiveEffect": "Passive bonuses apply automatically.Herrscher Charge starts at 200 and maxes at 600. When performing special Combo ATK and Ultimate, the Valkyrie is in Herrscher Form.Ultimate Evasion skill and Bombard inflict Blitzlock, which immobilize and paralyze enemies.When hitting an enemy inflicted with Narukami's Mark, Basic ATK, Combo ATK, Evasion ATK, and Ultimate deal 5%/20% ATK of bonus Lightning DMG to all marked enemies and recover 26/50 Herrscher Charge. CD: 0.05s. (No Herrscher Charge regen during Bombard and Finisher.)Falling Thunder: Certain moves can proc it to deal 30% ATK of Lightning DMG per 0.2s to all enemies marked with Narukami's Mark and restore 10 Herrscher Charge. Subsequent procs will extend the duration.",
        "ultimate": "Amaterasu's Ride",
        "ultimateEffect": "Enter burst mode and unleash full Herrscher power on the dragon's back.Ride the dragon to fight for 15s.The Valkyrie takes damage when the dragon is hit but she has 80% Total DMG Reduction, cannot die, restores 120 HP/s, and cannot cast weapon actives.Entry: 1,600% ATK of Lightning DMG and 600 Herrscher Charge regen.Barrage: Tap [ATK] repeatedly to attack, dealing 250% ATK of Lightning DMG per hit. The cyclone deals 25% ATK of Lightning DMG per 0.25s to enemies pulled in.Combo ATK - Bombard: Hold [ATK] and consume 50 Herrscher Charge per 0.2s, dealing 160% ATK of Lightning DMG and inflicting 0.5s of Blitzlock. Finisher: Deal 1,400% ATK of Lightning DMG and trigger a 4s Time Fracture. Switch out the Valkyrie (will suspend burst mode and perform Finisher upon next entry) or tap [ULT] again to perform.SP Cost: 125. Tap [ULT] 12s after activation or late to perform Finisher.",
        "evasion": "Tsukuyomi's Flash",
        "evasionEffect": "Evade enemy attacks up to twice a row.Evasion deals 120% ATK of Lightning DMG to enemies hit.Ultimate Evasion inflicts Narukami's Mark & Blitzlock on enemies for 2s. Base CD: 15s. Tap [ATK] within 1.5s of Ultimate Evasion to charge at and pull in enemies for follow up, dealing 250% ATK of Lightning DMG and proccing a 4s Time Fracture. In Ultimate: Activating Ultimate Evasion skill procs a 3s global Time Fracture and the next attack deals 300% ATK of bonus Lightning DMG. The activation and ending of Ultimate both reset Ultimate Evasion skill CD.",
        "basic": "Takemikazuchi's Edge",
        "basicEffect": "Lightning-imbued katana attacks. Evading after any of the first 3 sequences does not break the combo.1st Sequence: 60% ATK of Physical DMG + 60% ATK of Lightning DMG.2nd Sequence: 80% ATK of Physical DMG + 70% ATK of Lightning DMG.3rd Sequence: 60% ATK of Physical DMG + 80% ATK of Lightning DMG.4th Sequence: 250% ATK of Lightning DMG.5th Sequence: 300% ATK of Lightning DMG.5th Sequence of Basic ATK, Combo ATK, Ultimate Evasion skill, QTE, and Ultimate inflict Narukami's Mark on enemies for 15s. Marked enemies take 20% bonus Lightning DMG from the Valkyrie (independent effect).Narukami's Mark cannot coexist with Soul Razor's conductive effect from Lightning Empress.",
        "name": "Herrscher of Thunder"
    },
    "Infinite Ouroboros": {
        "character": "Mobius",
        "version": "5.2",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Lightning DMG, Time Mastery, Aerial",
        "profile": "Ranged Lightning DMG dealer with fast mob clearing.Combo ATK deals high DMG. Ultimate creates [Umbra of Ouroboros] and deals high DMG.",
        "leader": "Infinite Fate",
        "leaderEffect": "Ranged attackers on the team deal 17.0% bonus Total DMG; When summoned entities are present, team deals 20.0% bonus Lightning DMG. Persists for 25s (can be refreshed).",
        "special": "Combo: Distorting Scale",
        "specialEffect": "Release part of the Ouroboros to launch attacks.Combo ATK:1st Sequence: Deals 150% + 175% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.2nd Sequence: Deals 375% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.3rd Sequence: Deals 425% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.Can only continue to the next Combo ATK sequence within 5s of using Combo ATK. If more than 5s has elapsed, the next Combo ATK will revert to the 1st Sequence.Can continue to use Enhanced Basic ATK for a short time after Combo ATK evasion.While Enhanced Basic ATK is active, host's Move Speed is boosted and a barrier is formed that blocks 1 ATK.Combo ATK's 1st Sequence generates an Object X (summoned entity) that persists for 20s. It reduces the Move Speed of nearby enemies as well as slowly pulling them toward it. Triggering it again resets the duration.",
        "passive": "Undying Curse",
        "passiveEffect": "Character automatically gains passive bonuses.[Genesis Seed]: Up to 3 may be present at once. Using Combo ATK consumes 1 seed. 4th Sequence of Basic ATK restores 1 seed on hit.",
        "ultimate": "Honkai Activation",
        "ultimateEffect": "After completely transforming into Ouroboros form, unleash a powerful attack with a large AOE.Transform into Ouroboros and release lightning over a large area, dealing 420% × 5 + 50% × 3 ATK of Lightning DMG and restoring the max number of [Genesis Seeds]. Expand Umbra of Ouroboros for 12s. While Umbra of Ouroboros is present, Lightning DMG is boosted by 25%, and Enhanced Basic ATKs connected to Combo ATKs become Surging ATKs that deal 110% × 5 AKT of Lightning DMG and restore 1 [Genesis Seed] on hit.When Ultimate is cast, all skill timers of Valkyries and enemies as well as the stage timer are paused.Activation cost: 100 SP. CD: 20s.",
        "evasion": "Flickering Shadow",
        "evasionEffect": "Evade enemy attacks up to twice in a row.Successful Ultimate Evasion triggers 2.5s Global Time Fracture (CD: 10s) and induces submerged mode. Tap [ATK] in this mode to unleash a Surging ATK that deals 110% × 5 ATK of Lightning DMG and restores 1 [Genesis Seed] on hit. Submerged mode lasts for a max of 2.5s.",
        "basic": "Devouring Darkness",
        "basicEffect": "Valkyrie commands spikes formed by Umbra of Ouroboros to attack and inflict minor [[Paralyze Trauma]].Basic ATK:1st Sequence: Deals 80% ATK of Lightning DMG.2nd Sequence: Deals 40% × 3 ATK of Lighting DMG.3rd Sequence: Deals 100% ATK of Lightning DMG.4th Sequence: Deals 125% ATK of Lighting DMG.Evading after any of the Basic ATK's first 3 sequences allows you to proceed to the next sequence.",
        "name": "Infinite Ouroboros"
    },
    "Knight Moonbeam": {
        "character": "Kiana Kaslana",
        "version": "1.8",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Physical, Time Mastery, Fast ATK",
        "profile": "Good mid-to-close ranged AOE DPS. Easily triggers Time Fracture. High burst DMG with the help of crowd debuffs.",
        "leader": "Nebula Spectra",
        "leaderEffect": "Team gains 30% Crit DMG. Teams with 3 BIO-type characters gain 20% to Total DMG Multiplier.",
        "special": "Combo: Gunstorm",
        "specialEffect": "Unleashes a spinning gun kata after 3 consecutive shots.Spinning Kata: 8 x 28% ATK of AOE Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Gungnir Execution",
        "ultimateEffect": "Leaps into the air and summons the Valkyrie heavy cannon to annihilate the enemy.Scientific Cannon: Up to 2,500% ATK of Physical DMG.SP Cost: 100.",
        "evasion": "Time Fracture",
        "evasionEffect": "Quickly cartwheels away to evade enemy attacks. Can be performed twice in a rowTime Fracture: Triggers upon a 3s Ultimate Evasion; CD: 20s.Time Distortion: Valkyrie's Move Speed is significantly enhanced during Time Fracture triggered by her own evasion.",
        "basic": "Gyrodrive Kata",
        "basicEffect": "Fires 4 shots in rapid succession.1st Shot: 100% ATK of Physical DMG2nd Shot: 100% ATK of Physical DMG3rd Shot: 150% ATK of Physical DMG4th Shot: 100% x 2 ATK of scatter shot Physical DMG.",
        "name": "Knight Moonbeam"
    },
    "Kriegsmesser": {
        "character": "Murata Himeko",
        "version": "2.7",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Ice DMG, Freeze",
        "profile": "Stable melee DPS.Multiple Ice DMG hits.QTE and Ultimates can freeze enemies for a while.",
        "leader": "Ward of Boreas",
        "leaderEffect": "Team takes 14% less Melee Physical DMG.PSY-type character gains 8% Total DMG Multiplier.",
        "special": "Charge ATK: Fight for Survival",
        "specialEffect": "Tap and hold to charge to unleash an upward slash that deals 200% ATK of Physical DMG at full charge and 100% ATK of Physical DMG otherwise.When Threshold is at least 200, Charged ATK instantly spends 50 Threshold to activate Threshold mode.Threshold Mode: Consumes 20 Threshold every 0.5s, and ends at 0 Threshold or by ending the 4-sequence Basic ATK.Under Threshold Mode: Each attack move unleashes 3 Threshold Sword Ki that deals 50% ATK of Ice DMG per hit and slows enemy Attack Speed by 40% for 4s.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Threshold: Starts at 200 (max 600).",
        "ultimate": "Frost Cyclone",
        "ultimateEffect": "Unleashes mighty cleaves with the power of frost to deal massive Ice DMG.Unleash 3 freezing sword ki dealing 3 x 200% ATK of Ice DMG, then dash to the target to unleash a 3-hit windmill hew that deals 150% ATK of Physical DMG + 50% ATK of Ice DMG per hit. Final downward hew deals 300% + 200% ATK of Physical DMG plus 150% + 300% ATK of Ice DMG and unleashes a large AOE freeze for 3s.After dealing the final hit, character restores 200 Threshold.SP cost: 100.",
        "evasion": "Frost Touch",
        "evasionEffect": "Roll evasion. Can be performed 2 times in a row.Ultimate Evasion generates a 4 x 25% ATK of AOE Ice DMG centered on the enemy and restores 50 Threshold.Frost Touch: Additionally restores 100 Threshold; tap [ATK] right after Ultimate Evasion to unleash a Windmill Cleave that deals 50% + 100% ATK of Ice DMG and freezes the target for 3s; CD: 15s.",
        "basic": "Subzero Cleaver",
        "basicEffect": "Basic ATK: 4-sequence Zweihänder Melee Fechten.1st Sequence: 200% ATK of Physical DMG.2nd Sequence: 200% ATK of Physical DMG.3rd Sequence: 150% + 50% ATK of Physical DMG.4th Sequence: 250% ATK of Physical DMG.Does not enter charge phase when performing the 4-sequence Basic ATK.Sprint ATK: When sprinting, tap the [ATK] button for a large AOE sweep, dealing 450% ATK of Physical DMG.Hitting an enemy with the 4-sequence Basic ATK or Sprint ATK restores 30 Threshold.",
        "name": "Kriegsmesser"
    },
    "Lightning Empress": {
        "character": "Raiden Mei",
        "version": "1.8",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Lightning DMG, Paralyze",
        "profile": "Melee DPS.Pure lightning DMG.Gives massive SP to the whole team.",
        "leader": "Haunted Night",
        "leaderEffect": "Battlesuits have 50 bonus SP upon entrance. For a team of 3 PSY-type battlesuits, Valkyrie attacks deal 20% bonus Total DMG. In Open World, starting SP bonus can only be triggered once every 10min, and Valkyrie attacks deal 10% bonus Total DMG instead.",
        "special": "Gigavolt Spin",
        "specialEffect": "Fulminating Zone.Raiden Slash: 80% × 4 ATK of Lightning DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Dragon May Cry",
        "ultimateEffect": "Unleashes the powers of Thor, damaging all enemies within a large area.Thor's Slash: Large AOE attack that deals 900% ATK of Physical DMG and 900% ATK of Lightning DMG.SP Cost: 125.",
        "evasion": "Lightning Speed",
        "evasionEffect": "Quick dash to evade enemy attacks. Can be performed twice in a row.Lightning Dodge: Triggers upon an Ultimate Evasion and lasts 5s, during which the Valkyrie takes ''15%'' less Physical DMG and significantly gains Ignore Interrupt.Asura's Roar: Triggers upon an Ultimate Evasion and lasts 5s, during which the attacker is paralyzed and the Valkyrie takes 15% less Physical DMG and 80% less Lightning DMG; CD: 10s.",
        "basic": "Gotamashiki",
        "basicEffect": "Swift penta-slash with a 2% chance of paralyzing the target for 5s.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 120% ATK of Physical DMG.3rd Sequence: 75% ATK of Physical DMG.4th Sequence: 80% ATK of Physical DMG.5th Sequence: 250% ATK of AOE Physical DMG.",
        "name": "Lightning Empress"
    },
    "Luna Kindred": {
        "character": "Theresa Apocalypse",
        "version": "2.6",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Heavy ATK, Bleed, Time Mastery",
        "profile": "Mid-to-close range DPS.Heals HP by hitting Bleeding enemies.Charged ATKs: Bleed and suppress enemies.",
        "leader": "Mark of Cain",
        "leaderEffect": "Shortens duration of most debuffs by 25% for the team. BIO-type character gains 15% Physical DMG.",
        "special": "Charge ATK: Axe of the Fallen",
        "specialEffect": "Charge during the 4-sequence Basic ATK to swing an Axe!Tap and hold the [ATK] button during the 4-sequence Basic ATK to unleash Axe of the Fallen.After charging, tap the [ATK] button to swing the Axe. Other actions unsummon the Axe.50 or more Sanguine Mark: Attacks consume 50 Sanguine Mark.1st Sequence: 150% + 250% ATK.2nd Sequence: 150% + 250% ATK of Physical DMG.Less than 50 Sanguine Mark: Hits deal 100% + 200% ATK of Physical DMG.Sanguine Mark cap: 200.Sanguine Mark recovery: 5/s. Does not regenerate while undeployed.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Feast for the Dead",
        "ultimateEffect": "Drop the Axe of Fallen from the sky for large AOE damage.Axe Drop: 2 x 300% + 600% ATK of Physical DMG.SP cost to activate: 75.",
        "evasion": "Ethereal Nightmare",
        "evasionEffect": "Quick sideways dodge to evade enemy attack. Can be triggered 2 times in a row.After Ultimate Evasion, gain 40% Move Speed for 3s.Time Fracture: Triggers Time Fracture upon an Ultimate Evasion, slowing all enemies for 3s. CD: 15s.",
        "basic": "Tainted Blades",
        "basicEffect": "Basic ATK: 4-sequence twin blade Melee ATK.1st Sequence: 2 x 50% ATK of Physical DMG.2nd Sequence: 2 x 50% ATK of Physical DMG.3rd Sequence: 2 x 60% + 70% ATK of Physical DMG.4th Sequence: 2 x 50% + 2 x 70% ATK of Physical DMG.",
        "name": "Luna Kindred"
    },
    "Midnight Absinthe": {
        "character": "Natasha Cioara",
        "version": "5.2",
        "rank": "A",
        "type": "IMG",
        "core_strengths": "Fire DMG, Time Mastery",
        "profile": "Ranged Elemental Support.Ultimate covers a large area with smoke that boosts Fire DMG enemies take.",
        "leader": "Midnight Gathering",
        "leaderEffect": "Boosts team's Ultimate Fire DMG by 10.0% as well as increasing the team's Max HP by 10.0%.",
        "special": "Charged: Heartpiercer",
        "specialEffect": "Hold [ATK] to release Charged ATK.Hold [ATK]: Triggers Charged ATK Shoots 6 Feather Blades in all directions, each dealing 20% ATK of Fire DMG.Then deals 250% ATK of Fire DMG to surrounding enemies, and temporarily pulls in enemies in front of her. Also gathers all Feather Arrows/Feather Blades/Feathers on the battlefield and earns a corresponding number of [Night Roamer] Enhancement stacks.Tap [ATK] immediately after using Charged ATK to connect to Basic ATK's 5th sequence.",
        "passive": "Ominous Wings",
        "passiveEffect": "Passive bonuses apply automatically.Balanced bow wielder who has up to 2 shooting chances.One is restored every 10s if less than 2 remain.Corrected modifier of normal shooting: 100%.Corrected modifier of aimed shooting: 100%.When she picks up Feather Arrows/Feather Blades/Feathers on the battlefield, gain [Night Roamer] stacks (up to 20). Lasts for 10s. Repeatedly gaining stacks extends and refreshes the duration.10 stack bonus: Deal 10% bonus Fire DMG.15 stack bonus: Deal 15% bonus Fire DMG.20 stack bonus: Deal 20% bonus Fire DMG.",
        "ultimate": "Nightbird's Call",
        "ultimateEffect": "Fire a powerful shot at enemies after unleashing a multi-sequence ATK.Midnight Absinthe hides in the flock of crows, and quickly launches an assault that deals 6 × 150% ATK of Fire DMG to enemies. Then shoots an arrow at the ground that deals 300% ATK of Fire DMG to the target and then explodes dealing 700% ATK of Fire DMG to surrounding enemies. Clears all [Night Roamer] stacks, and simultaneously creates a cloud of smoke over the battlefield that lasts for 18s.When enemies in the smoke take DMG from her teammates' ATK or her own Weapon Skills, an explosion that deals 600% ATK of Fire DMG  will be triggered with a 1s delay. This DMG counts as Midnight Absinthe's Ultimate DMG.CD: 4s.Activation cost: 100 SP. CD: 20s.",
        "evasion": "Enchanting Requiem",
        "evasionEffect": "Evade enemy attacks up to twice in a row.Ultimate Evasion: Trigger Global Time Fracture for 3s. CD: 15s.Tap [ATK] immediately after Ultimate Evasion to connect to Basic ATK's 3rd Sequence.",
        "basic": "Silenced Flechette",
        "basicEffect": "Use a bow to shoot at enemies.1st Sequence: 3 Feather Arrows, each dealing 20% ATK of Fire DMG.2nd Sequence: 2 combo hits, dealing 50% + 70% ATK of Fire DMG.3rd Sequence: 3 combo hits, dealing 40% + 40% + 200% ATK of Fire DMG.4th Sequence: 4 Feather Arrows, each dealing 70% ATK of Fire DMG.5th Sequence: 5 Feather Arrows, each dealing 50% ATK of Fire DMG.Feather Arrows shot from the bow will remain on the field. There can be no more than 20 Feather Arrows/Feather Blades/Feathers on the field at once.",
        "name": "Midnight Absinthe"
    },
    "Miss Pink Elf♪": {
        "character": "Elysia",
        "version": "5.1",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Physical, Fast ATK, Time Mastery, Aerial",
        "profile": "Ranged Physical DMG dealer.Charged ATK deals high DMG.Ultimate creates Flawless Dome which enables Charged ATK ricochet to deal massive DMG.",
        "leader": "An Ode to Love and Compassion",
        "leaderEffect": "Team deals 15.0% bonus Total Shield DMG. Combo/Charged ATKs from any team member have 10.0% bonus Crit Rate.",
        "special": "Charged ATK: An Oath to Wind and Moon",
        "specialEffect": "Hold [ATK] to cast Charged Shot: Cupid's Bolt. Tap [ATK] repeatedly afterwards to repeat Cupid's Bolt.Cupid's Bolt has 2 sequences in normal form and 3 sequences when Flawless Dome is active.1st Sequence: 200% ATK of Physical DMG.2nd Sequence: 210% ATK of Physical DMG.3rd Sequence: 500% ATK of Physical DMG.Each cast of Cupid's Bolt costs 100 Infatuation.Cupid's Bolt can detonate Crystalline Seeds on the target, dealing 100% ATK of Physical DMG to enemies within a 4-meter range. The detonation will spread to Crystalline Seeds on enemies nearby and does not consume Crystalline Seeds. Detonation CD: 1s.",
        "passive": "A Saga of Origins and Endings",
        "passiveEffect": "Passive bonuses apply automatically.Infatuation maxes at 400 and 30 is restored per second.Balanced archer with up to 2 shooting chances (one is restored every 10s if less than 2).When Ultimate is not in cooldown and within 5s of casting a Weapon Skill, Ultimate costs 30% less SP and restores 100 Infatuation (200 if Flawless Dome is active). In addition, tapping [ATK] after using Ultimate can cast Cupid's Bolt.Corrected modifier of non-aimed shooting: 100%.Corrected modifier of aimed shooting: 100%.",
        "ultimate": "The Beginning of You and I",
        "ultimateEffect": "Create a Flawless Dome which enhances Miss Pink Elf♪'s abilities.Shoot a magical arrow that creates a Flawless Dome for 12s.When Flawless Dome is active, Miss Pink Elf♪ is enhanced:She deals 15% bonus Physical DMG and has a 10% bonus Crit Rate.Infatuation maxes at 600 and casting Ultimate fully restores it.The 3rd sequence of Cupid's Bolt is enhanced and every sequence can trigger a ricochet. The ricochets of the 1st/2nd/3rd sequence deal 200%/200%/200% + 200% ATK of Physical DMG respectively (only under Flawless Dome).Casting Ultimate pauses all skill timers for Miss Pink Elf♪ and enemies as well as the stage timer.Activation Cost: 100 SP. CP: 20s.",
        "evasion": "A Blessing from Heaven and Earth",
        "evasionEffect": "Quickly dodge enemy attacks up to twice in a row.Successful Ultimate Evasions can trigger the Ultimate Evasion Skill, inducing 3s of global Time Fracture and restoring 50Infatuation. CD: 18s.Evading while Basic ATK is in progress does not break the sequence.",
        "basic": "An Arrow for Flower and Fowl",
        "basicEffect": "Shoot arrows with a bow.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 60% + 60% ATK of Physical DMG.3rd Sequence: 150% ATK of Physical DMG.4th Sequence: 200% ATK of Physical DMG.Each hit of Basic ATK applies a Crystalline Seed to the target (up to 4). Crystalline Seeds remain effective throughout the battle.",
        "name": "Miss Pink Elf♪"
    },
    "Molotov Cherry": {
        "character": "Rozaliya Olenyeva",
        "version": "3.1",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Physical, Gather, Time Mastery",
        "profile": "Close- to mid-range DPS.Deals massive Physical DMG.Charged ATK deals more DMG with time.",
        "leader": "SHOWTIME!",
        "leaderEffect": "Entire team gains 20.0% Melee Physical DMG.",
        "special": "Charged ATK: TYPHOON! YAY!",
        "specialEffect": "Spin ATK that hurts nearby enemies.TYPHOON CHOP: Tap and hold [ATK] to spin, dealing 110% ATK of Physical DMG. Release the [ATK] button to stop the spinning.TYPHOON CHOP builds up spice and must stop when it's too spicy, but Spice dissipates faster that way. Attacks on Roza gain +7% Total DMG Multiplier per second in TYPHOON CHOP. Max stacks: 7.[[Blueberry Blitz]] in the team: TYPHOON CHOP pulls in enemies. Release and tap [ATK] to unleash VODKA FINALE, dealing 1,100% ATK of Physical DMG but adding 33% Spice.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Some attacks become Joint ATKs when [[Blueberry Blitz]] is also on the team. During Joint ATKs, Blueberry Blitz is considered to be summoned and the damage comes from Molotov Cherry.With Blueberry Blitz alive, Basic ATK Sequence 3/4 reduces Spice by 5%/10% respectively, while Joint ATK Sequence 3/4/5 reduces Spice by 5%/5%/10% respectively.",
        "ultimate": "VODKA CHOPPA",
        "ultimateEffect": "A powerful chop that demolishes nearby enemies.CHOPPA: 2,000% ATK of Physical DMG.CHOPPA WITH LILI (Joint ATK): 500% + 3,000% ATK of Physical DMG. [[Blueberry Blitz]] also gains 35 SP.SP Cost: 100. Base CD: 20s.",
        "evasion": "CAN'T TOUCH ME!",
        "evasionEffect": "Evades enemy attack.VODKA SHIELD: Ultimate Evasion triggers a 3s Time Fracture and generates a shield that absorbs DMG equal to 15% of the Valkyrie's Max HP.The shield lasts 6s; CD: 15s.",
        "basic": "CHOP CHOP!",
        "basicEffect": "4-Sequence greatsword swing!1st Sequence: 110% ATK of Physical DMG2nd Sequence: 60% + 70% ATK of Physical DMG3rd Sequence: 50% + 150% ATK of Physical DMG4th Sequence: 2 x 40% + 200% ATK of Physical DMGJoint ATK Sequence 2: 130% + 90% ATK of Physical DMGJoint ATK Sequence 3: 100% + 100% ATK of Physical DMGJoint ATK Sequence 4: 140% + 100% ATK of Physical DMGJoint ATK Sequence 5: 2 x 60% + 150% ATK of Physical DMG",
        "name": "Molotov Cherry"
    },
    "Night Squire": {
        "character": "Fu Hua",
        "version": "2.3",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Bleed, Burst, Fast ATK, Time Mastery",
        "profile": "Melee DPS.Spends Ripple to boost Combo ATK DMG.Ultimate: Non-stop combo attacks.",
        "leader": "Night Squire",
        "leaderEffect": "Team gains 12.0% max HP. BIO-type characters gain 24.0% Crit DMG.",
        "special": "Combo: Aurora",
        "specialEffect": "Different Six Fists moves can be connected to various Combo ATKs.Ri-Ki Raptor Strike: Up to 400% ATK of Physical DMG.Ri-Ki Rending Claw: Up to 460% ATK of Physical DMG.Ri-Ki Talon Storm: Up to 490% ATK of Physical DMG.Ri-Ki Moon Anseri: Up to 520% of ATK of Physical DMG.Initial Ripple: 3. Can store up to 5 charges.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Thousand Stars",
        "ultimateEffect": "Consume 100 SP to enter Burst mode for 8s.Burst mode: Gain 30% Attack Speed. Tapping any [ATK] button quickly directly triggers Combo ATK to deal tons of DMG.During Burst Mode: Enemies in a small AOE around the character suffer 50% slower Move Speed.Burst mode activation provides max Ripple.",
        "evasion": "Blink",
        "evasionEffect": "Quick shift for evading enemy attacks.Time Fracture: Ultimate Evasion triggers global Time Fracture, slowing all enemies for 3s. CD: 15s.Gain 1 Ripple with Ultimate Evasion.",
        "basic": "Iron Strike",
        "basicEffect": "Fight using the Six Fists.Ri-Ki Darting Kite: 400% ATK of Physical DMG.Ri-Ki Phoenix Soar: 370% ATK of Physical DMG.",
        "name": "Night Squire"
    },
    "Palatinus Equinox": {
        "character": "Durandal",
        "version": "5.5",
        "rank": "S",
        "type": "IMG",
        "core_strengths": "Physical, Time Mastery",
        "profile": "Melee Physical DMG dealer.Charged ATK after Ultimate Evasion or Sprint deals high DMG.Ultimate directly damages Nihilus Seeds.Can suppress enemies with Throws.",
        "leader": "Stellar Crusader",
        "leaderEffect": "Team deals 21.0% bonus Physical DMG. Weapon skills have 32.0% bonus Crit Rate.",
        "special": "Glorious Schariac",
        "specialEffect": "The black armor turns into a war horse for mounted combat.SEQ 1: 150% + 200% ATK of Physical DMG.SEQ 2: 3 × 120% ATK of Physical DMG.SEQ 3: 400% ATK of Physical DMG.SEQ 4: 600% ATK of Physical DMG.In Flash State, tap [EVA] to induce Stomp or hold [ATK] to induce Sprint. Release [ATK] in Sprint State to unleash Elite Thrust.Stomp: Deals 350% ATK of Physical DMG and gather enemies nearby. Hold [ATK] to induce Sprint.Sprint: Deals N × 110% ATK of Physical DMG (N stands for hits and caps at 10). Hitting enemies consumes ICHOR.Elite Thrust: 800% ATK of Physical DMG.Stomp, Sprint, and Elite Thrust are all considered Charged ATK with Adamance and Iron Body.To walk slowly: Steer the left joystick if using a phone or a controller. Hold Shift and a direction key if using a keyboard.",
        "passive": "Aria Palantinus",
        "passiveEffect": "Passive bonuses apply automatically.ICHOR: Maxes at 300 and auto-restores over time. Casting weapon skill restores 50 ICHOR. In Knight Form, Palatinus Equinox restores more ICHOR when moving and enters Flash State when it's fully charged.ICHOR is reset when Palatinus Equinox switches form or exits.",
        "ultimate": "Equinox March",
        "ultimateEffect": "Mount the war horse and reach max speed to deal massive Physical DMG.Tap: Switch between Knight Form and Guardian Form. Knight to Guardian triggers Shield Ram. Guardian to Knight enables active Ultimate Evasion Skill.Hold: Perform a mighty blow to deal 2,000% ATK of Physical DMG in a large area and suspend all skill timers as well as the stage timer.SP cost: 100. CD: 20s.",
        "evasion": "Duality of Antinomy",
        "evasionEffect": "Guardian Form for defense and Knight Form for evasion.Ultimate Evasion Skill: Triggers 2s of global Time Fracture and fully charges ICHOR. CD: 15s.Guardian Form: Backward evasion triggers Defense and forward evasion triggers Shield Ram.Taking hits during Defense or hitting enemies with Shield Ram triggers Retaliation which negates incoming attack, deals 120% ATK of Physical DMG, and triggers Ultimate Evasion Skill. Shield Ram can also trigger Ultimate Evasion Skill passively.Tap [ATK] after Retaliation to perform Up Thrust (or Equinox Severance when Ultimate Evasion Skill is triggered)Knight Form: Active evasion triggers Ultimate Evasion Skill (Leap Stomp cannot). During Ultimate Evasion Skill: Tap a direction key to trigger Flash State; Tap [EVA] to trigger Stomp; Hold [ATK] to trigger Sprint.",
        "basic": "Immortal Kaslana",
        "basicEffect": "Fight with the lance and the shield.SEQ 1: 150% + 200% ATK of Physical DMG.SEQ 2: 220% ATK of Physical DMG.SEQ 3: 8 × 80% ATK of Physical DMG.Enemies are also gathered briefly.SEQ 4: 300% ATK of Physical DMG.At full ICHOR, hold [ATK] to cast Equinox Severance which triggers 3s of global Time Fracture and deals 300% + 300% + 200% + 1200% ATK of Physical DMG.Shield Ram: 150% ATK of Physical DMG.Up Thrust: 750% ATK of Physical DMG.",
        "name": "Palatinus Equinox"
    },
    "Phantom Iron": {
        "character": "Rita Rossweisse",
        "version": "3.0",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Lightning DMG, Paralyze",
        "profile": "Melee DPS.Charged ATK converts Basic ATK DMG into buffed Lightning DMG.Ultimate: Summons Stalker Carbon to buff team Elemental DPS.",
        "leader": "Ex Machina",
        "leaderEffect": "Team takes 15.0% less Elemental DMG. MECH-type characters: Basic ATK gains 12.0% Total DMG Multiplier.",
        "special": "Charge: Lightning Phantom",
        "specialEffect": "Hold [ATK] during the 5-sequence Basic ATK to shuttle through the enemy and enter Supercharged mode.Charged ATK: Shuttles through the target, dealing 4 x 150% ATK of Lightning DMG, then enters Supercharged state.Supercharged state: 5-sequence Basic ATK deals Lightning DMG instead (same amount).",
        "passive": "Super Discharge",
        "passiveEffect": "Character automatically gain passive bonuses.Load: Starts at 0. Maxes out at 200.Supercharged: Gain 30% Move Speed but Load increases by 25/s.Max Load: Becomes Depleted, with Move Speed becoming 20% slower.Depleted: Load decreases by 15/s until 0.",
        "ultimate": "Stalker Carbon",
        "ultimateEffect": "Deploys Stalker Carbon (summoned entity) for 24s (no recast during this time).Special moves release a Neurotoxin that inflicts Psycho on teammates and enemies.Affected enemies: Deal +10% Elemental DMG, but have reduced Ignore Interrupt and take 10% more Total DMG from hits.Affected teammates: Deal +15% Elemental DMG and gain Ignore Interrupt, but take 15% more Total DMG from hits.CD: 18s. Min. SP: 35. Stalker Carbon consumes SP faster over time, lowers SP regen from attacks by 50%, and exits 3s after SP is depleted.",
        "evasion": "Lightning Reflex",
        "evasionEffect": "Quickly evade enemy attacks. Can be performed twice in a row.Upon Ultimate Evasion, reduce 30 Load and gains 40% Move Speed for 3s.Lightning Reflex: Upon Ultimate Evasion, deals 300% ATK of Lightning DMG against the attacker and nearby enemies and paralyzes them for 2s; reduces 80 Load; immediately tap [ATK] to directly unleash the 4th Sequence of Basic ATK.CD: 15s.",
        "basic": "Iron Storm",
        "basicEffect": "5-sequence scythe sweeps.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 40% + 100% ATK of Physical DMG.3rd Sequence: 40% + 100% ATK of Physical DMG.4th Sequence: 50% + 120% + 150% ATK of Physical DMG.5th Sequence: 4 x 40% + 200% ATK of Physical DMG.",
        "name": "Phantom Iron"
    },
    "Phoenix": {
        "character": "Fu Hua",
        "version": "2.2.5",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Fire DMG, Weaken, Time Mastery",
        "profile": "Melee DPS.Buffs Elemental DMG of team when tagged out.Use different Combos to gain Prajna and buff her skills.",
        "leader": "Flaming Heart",
        "leaderEffect": "Team gains 10% Attack Speed. Teams with 3 PSY-type characters gain 28% Total DMG Multiplier to combo, charged, and ultimate attacks.",
        "special": "Combo: Flame Gust",
        "specialEffect": "Stances can be connected into different Combo ATKs.Sen-Ki Simurgh: Up to 460% ATK of Physical DMG.Sen-Ki Dashing Tern: Up to 660% ATK of Physical DMG.Sen-Ki Moon Anseri: Up to 660% ATK of Physical DMG.When using a different combo ATK move compared to last time (or when the attack move has been reset), then Sen-Ki Simurgh/Dashing Tern/Moon Anseri will gain 150/200/150 Prajna respectively.Character can store up to 400 Prajna, and Prajna will slowly drain. Higher Prajna will improve.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Spirit of Cinder",
        "ultimateEffect": "Transform into the Spirit of Cinder to deal large AOE damage.Spirit of Cinder: 1,500% ATK of Fire DMG to enemies in a large AOE.Spirit of Cinder resets attack moves (any Combo ATK afterwards will gain Prajna).SP Cost: 100.",
        "evasion": "Fairy Dance",
        "evasionEffect": "Quickly blinks to the enemy to attack.Mass Immobilize: Ultimate Evasion inflicts Time Lock on the target and nearby enemies in a small AOE for 1.5s. CD: 15s.Ultimate Evasion resets attack move (any Combo ATK afterwards will gain Prajna).Tap [Ultimate] after Ultimate Evasion to directly perform Sen-Ki Dashing Tern's Shuttle ATK, during which and the following 1s, tap [Ultimate] again to unleash another Shuttle ATK (once only).",
        "basic": "Rectrix",
        "basicEffect": "Fight enemies using Punch Arts.Sen-Ki Darting Swift: Up to 660% ATK of Physical DMG.Sen-Ki Phoenix Soar: Up to 470% ATK of Physical DMG.Last sequence of Basic ATK resets the attack move (any Combo ATK afterwards will gain Prajna).",
        "name": "Phoenix"
    },
    "Prinzessin der Verurteilung!": {
        "character": "Fischl",
        "version": "4.9",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Lightning DMG, Fast ATK, Time Mastery, Aerial",
        "profile": "Long-range Lightning DMG dealer.QTE can inflict Lighting Vulnerability.Summons familiar to attack fast.",
        "leader": "Evernight Suite",
        "leaderEffect": "Ranged attackers on the team deal 6.0% bonus Total DMG; team deals 16.0% bonus Elemental DMG.",
        "special": "Charged ATK: Nightrider",
        "specialEffect": "Hold [ATK] to summon Oz to aid in battle and enhance Fischl's Basic ATK while it's presentHold [ATK] to summon Oz (summoned entity) lasting 12s. Oz is a melee attacker and deals 40% × 12 ATK of Lightning DMG. While it's present, Fischl's Basic ATKs become enhanced and her attack speed increases.Hold [ATK] while Oz is present to launch Charged ATK dealing 300% ATK of Lightning DMG.",
        "passive": "Shrieking Shaft",
        "passiveEffect": "Passive bonuses apply automaticallyBalanced archer with up to 2 shooting chances (one is restored every 10s if less than 2).Corrected modifier of non-aimed shooting: 100%.Corrected modifier of aimed shooting: 100%.",
        "ultimate": "Midnight Phantasmagoria",
        "ultimateEffect": "Command Oz to launch a rain of arrows.Command Oz to soar up and rain down a shower of arrows, dealing 20% × 50 ATK of Lightning DMG before Oz dives down to create a massive explosion dealing 1000% ATK of Lightning DMG.Oz will remain on the field after Ultimate to attack enemies. If Oz is already present when casting Ultimate, its duration will be reset.Activation Cost: 100 SP. CD: 20s.",
        "evasion": "Shadow Step",
        "evasionEffect": "Evade enemy attacks up to twice in a row.Ultimate Evasions deal 50% × 5 ATK of Lightning DMG and trigger 3s of Time Fracture. CD: 18s.While Oz is present, hold [ATK] right after an evasion to perform Charged ATK.",
        "basic": "Bolts of Downfall",
        "basicEffect": "Bow attacks which inflict minor [[Paralyze Trauma]].Basic ATK:1st Sequence: 25% ATK of Lightning DMG.2nd Sequence: 40% ATK of Lightning DMG.3rd Sequence: 80% ATK of Lightning DMG.4th Sequence: 60% ATK of Lightning DMG.5th Sequence: 180% ATK of Lightning DMG.Enhanced ATK:1st Sequence: 25% × 3 ATK of Lightning DMG.2nd Sequence: 40% × 3 ATK of Lightning DMG.3rd Sequence: 80% × 3 ATK of Lightning DMG.4th Sequence: 60% × 3 ATK of Lightning DMG.5th Sequence: The central arrow deals 360% ATK of Lightning DMG and the 4 other arrows deal 60% × 4 ATK of Lightning DMG.",
        "name": "Prinzessin der Verurteilung!"
    },
    "Reverist Calico": {
        "character": "Pardofelis",
        "version": "5.6",
        "rank": "A",
        "type": "IMG",
        "core_strengths": "Ice DMG, Freeze, Time Mastery",
        "profile": "Melee Ice DPS.Can inflict high [[Rime Trauma]] and make freezing more effective for the team.Can restore large amounts of SP for the team.",
        "leader": "Life Is but a Reverie",
        "leaderEffect": "Team restores SP 16.0% faster and deals 26.0% bonus Total DMG to frozen enemies.",
        "special": "Combo: All Paws on Deck",
        "specialEffect": "Command Can to assist in battle.Two Combo ATK variations based on Can's two Moods. Hold [ATK] with full Mood to consume all of it and perform Combo ATK of the matching Mood.Consume full Angry Mood to cast Double Scratch and deal 500% ATK of Ice DMG.Consume full Well-behaved Mood to cast Frozen Can, gather enemies, and deal 300% ATK of Ice DMG.",
        "passive": "Shopowner",
        "passiveEffect": "Passive bonuses apply automatically.The kitten Can helps Reverist Calico in battle. It shows two different Moods, Angry and Well-behaved, and the Mood type decides Can's attack pattern. Both types of Mood cap at 100.Basic ATK SEQ 1 to 4 restore 20 current Mood on hit, and SEQ 5 restores 100.Entering the field resets Mood to Angry.When wielding a Chakram, Reverist Calico uses it as dual blades and obtains weapon skill Paw Barrage, which makes her charge forward and strike enemies repeatedly dealing 125% + 150% x 2 ATK of Ice DMG and switching Mood. The skill has up to 2 charges and 6s CD.",
        "ultimate": "Megaton Furball",
        "ultimateEffect": "A giant Can falls from the sky and slam enemies.Reverist Calico hurls the Chakram high up and then Can falls through it to be enlarged and slam enemies dealing literally tons of DMG.Tap [ULT] to deal 2,000% ATK of Ice DMG, inflict 18 [[Rime Trauma]], fully restore two types of Mood, and activate Runaway lasting 10s.In Runaway, two types of Combo ATK deal 50% bonus Ice DMG and switching Mood fully restores Mood of the current type.Exiting ends Runaway.SP cost: 125. CD: 20s.",
        "evasion": "Gonna Bounce",
        "evasionEffect": "Dash quickly to evade enemy attacks. Can be performed twice in a row.Ultimate Evasion triggers 3s of Global Time Fracture. CD: 15s.",
        "basic": "Gotta Pounce",
        "basicEffect": "Wield the Chakram as dual blades to slash enemies.SEQ 1: 100% ATK of Ice DMG.SEQ 2: 100% ATK of Ice DMG.SEO 3: Triple strikes dealing 50% + 70% x 2 ATK of Ice DMG.SEO 4: Summon cat paws dealing 120% ATK of Ice DMG.SEQ 5: Swing cat paws dealing 50% x 2 + 200% ATK of Ice DMG.",
        "name": "Reverist Calico"
    },
    "Ritual Imayoh": {
        "character": "Kallen Kaslana",
        "version": "2.2.8",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Stun, Time Mastery",
        "profile": "Mid-to-close range AOE DPS.Stores Kinetic Energy for Physical DMG skill.Ultimate summons a turret for DPS spike.",
        "leader": "Starlight Blessing",
        "leaderEffect": "Team gains 12% max HP during combat, and MECH-type characters gain 7% Crit Rate during battle.",
        "special": "Combo: Galactic Collapse",
        "specialEffect": "Tap and hold after the 1st Sequence of the Basic ATK to unleash Combo ATK.Kinetic Energy (KE) maxes out at 900 (3 stacks of 300 KE each) and slowly regenerates when character is deployed. Combo ATK effect is based on amount of KE stacks filled.0 KE: 2 x 60% ATK of Physical DMG.1 stack (1-300 KE): 3 x 170% ATK of Physical DMG.2 stacks (301-600 KE): 5 x 200% ATK of Physical DMG.3 stacks (601-900 KE): 2-stack effect plus homing missiles that deal up to 4 x 250% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Death Nova",
        "ultimateEffect": "Summon a gun turret for battle.Deploys the Eljudnir gun turret [Summoned] that fires 40 penetrating light bullets, dealing 35% Physical DMG for each shot.SP Cost: 60.",
        "evasion": "Sternenphantom",
        "evasionEffect": "Quickly evades enemy attack. Can be performed twice in a row.Within a short duration after Ultimate Evasion, tap [ATK] to quickly dash to the enemy and unleash a Flying Kick that can be linked to the 4th sequence of the Basic ATK.Time Fracture: Triggered upon an Ultimate Evasion and slows the speed of all enemies for 3s. CD: 15s.",
        "basic": "Torrential Nebula",
        "basicEffect": "6-sequence Gun Kata.Mechanically enhanced 6-sequence Gun Kata:1st Sequence: 2 x 50% ATK of Physical DMG.2nd Sequence: 3 x 40% ATK of Physical DMG.3rd Sequence: 3 x 50% + 50% ATK of Physical DMG.4th Sequence: 100% x 150% ATK of Physical DMG.5th Sequence: 10 x 50% + 100% ATK of Physical DMG.6th Sequence: 3 x 100% ATK of Physical DMG.",
        "name": "Ritual Imayoh"
    },
    "Sakuno Rondo": {
        "character": "Theresa Apocalypse",
        "version": "2.2.1.5",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Fire DMG, Ignite, Burst, Fast ATK",
        "profile": "Flexible mid-ranged DPS.Suppresses solo enemies.Massive Fire DMG during burst.",
        "leader": "Ritual Dance",
        "leaderEffect": "For the team, attacks made against enemies knocked airborne gain 15% Total DMG Multiplier. Teams with 3 characters of different types gain 12% Elemental DMG.",
        "special": "Charged: Scorching Foxfire",
        "specialEffect": "Charge during the 5-sequence Basic ATK to unleash Foxfire.Tap and hold the [ATK] button to charge during a 5-sequence Basic ATK or Ultimate to unleash Foxfire after a short charge, dealing 3 x 50% ATK of Fire DMG to target and its surrounding enemies.Foxfire transforms Sakura Brand into Scorching Sakura Brand that then explodes after 1s, dealing 300% ATK of Fire DMG and knocking enemies airborne.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Sakura Brand: Clears the Sakura Count on enemy once the count has reached 3 and inflicts a Sakura Brand. The Sakura Brand lasts for 10s.",
        "ultimate": "Hijoyo Frenzy",
        "ultimateEffect": "Unleash Valkyrie burst to enter Hijoyo Mode and gain increased Ignore Interrupt.Unleashes a 3-sequence combo slash to all targets in a large AOE when triggered, each hit dealing 100% ATK of Physical DMG and adding a Sakura Count.Hijoyo Mode: Turns the 5-sequence combo into an Ultimate 5-sequence combo, dealing Fire DMG for more DMG and transforms the Sakura Brand.The 3rd and 5th sequences add a Sakura Count on the target.Continuous Burst: Consumes 20 SP to activate and 8 SP/s afterwards. Max duration: 60s.SP Cost: 80.",
        "evasion": "Burning Kenbu",
        "evasionEffect": "Quick side-step to evade enemy attacks.Ultimate Evasion: Generates a 3-sequence sword aura, each hit dealing 10% ATK of Physical DMG to surrounding enemies. Character gains 40% Move Speed for 3s.Burning Kenbu: Each sword ki hit adds 1 Sakura Count to the target. Tap the [ATK] button within a short duration to directly unleash Foxfire. CD: 15s.",
        "basic": "Fox Blade",
        "basicEffect": "Basic ATK: Mid-range 5-sequence attack with ethereal katanas.1st Sequence: 3 x 40% ATK of Physical DMG.2nd Sequence: 3 x 40% ATK of Physical DMG.3rd Sequence: 150% ATK of Physical DMG.4th Sequence: 2 katanas dealing 3 x 40% ATK of Physical DMG each.5th Sequence: 180% ATK of Physical DMG.The 3rd and 5th sequences add 1 Sakura Count to the target.",
        "name": "Sakuno Rondo"
    },
    "Scarlet Fusion": {
        "character": "Murata Himeko",
        "version": "1.8",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Lightning DMG, Heavy ATK, Burst, Paralyze",
        "profile": "Stable melee DPS.Attack in special tempo for DMG buff.Ultimate: Powerful Burst DMG and suppression.",
        "leader": "Nuclear Armaments",
        "leaderEffect": "Team gains 15% Total DMG Multiplier to switch skill attacks.",
        "special": "Charge: Fusion Assault",
        "specialEffect": "Charging on the spot initiates a forward dash and upward slash that knocks the enemy airborne.Sprinting Zornhut: Tap and hold the [ATK] button to start, and pushes the enemy forward, then release the [ATK] button to knock the enemy airborne and deal 400% ATK of Physical DMG.Sprint ATK: During sprinting, tap the [ATK] button to launch a jump cleave that deals 500% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Nexus Unlock",
        "ultimateEffect": "Enters the Valkyrie state, enhancing all attacks.Burst: Enhances most attack moves, ATK Speed, and Interrupt ability.At over 100 SP, consumes 20 SP to activate and 10 SP/s afterwards until SP is depleted; Max duration: 60s.",
        "evasion": "Fusion Roll",
        "evasionEffect": "Evasive roll. Can be triggered twice in a row.Nuclear Propulsion: After Ultimate Evasion, Move Speed increases by 40% for 3s. Tap [ATK] button at the moment of Ultimate Evasion to immediately launch a Sprint ATK jump cleave.Nuclear Charge: After an Ultimate Evasion, receives a 5s EM Charge that increases Ignore Interrupt; CD: 15s.EM Blast: During EM Charge, hitting an enemy generates an EM Blast that deals 80% ATK of Lightning DMG to target and surrounding enemies, and paralyzes them for 3s.",
        "basic": "Heavy Sword",
        "basicEffect": "Basic ATK: Tri-strike. Triggering Perfect Combo boosts Ignore Interrupt.Tri-Strike: Each strike deals 150%, 180%, and 250% ATK of Physical DMG respectively.Perfect Combo: Triggered by tapping [ATK] when a flashing circle appears on the Valkyrie to gain 15% Crit Rate for this attack.When 2 consecutive (interval is less than 2s) Perfect Combos are triggered, charges the weapon briefly; within the 10s, the first Sprinting Zornhut unleashed will also launch a Spinning Blade that deals 3 x 200% ATK of Lightning DMG.",
        "name": "Scarlet Fusion"
    },
    "Shadow Dash": {
        "character": "Raiden Mei",
        "version": "1.8",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Fast ATK",
        "profile": "Middle-range follow-up & sustained damage.Boosts team Physical DMG.Ultimate can support teammates on standby.",
        "leader": "Phantom Outbreak",
        "leaderEffect": "Team gains 15% Crit Rate at above 80% HP.",
        "special": "Combo: Speed Fatale",
        "specialEffect": "Dashes to enemy and knocks it airborne.Charging Cut: 180% ATK of Physical DMG and knocks enemies airborne.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Tsukuyomi",
        "ultimateEffect": "Summons an Ultimate Illusion to assist in battle.Illusion (summoned entity) has 50% of Valkyrie's HP, 100% of her ATK and CRT, plus Physical DMG immunity. It loses 10% of its max HP per second.SP Cost: 75.",
        "evasion": "Untouchable",
        "evasionEffect": "Dashes quickly to evade enemy attacks.Body Clone: An illusion (summoned entity) joins the fight upon Ultimate Evasion. Illusion has 25% of Valkyrie's ATK and lasts 5s. CD: 10s. Only 1 illusion can exist at any given time.",
        "basic": "Gokiketsu",
        "basicEffect": "AOE penta-slash.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 80% ATK of Physical DMG.3rd Sequence: 100% ATK of Physical DMG.4th Sequence: 100% ATK of Physical DMG.5th Sequence: 250% ATK of AOE Physical DMG.",
        "name": "Shadow Dash"
    },
    "Shadow Knight": {
        "character": "Fu Hua",
        "version": "2.6",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Lightning DMG, Bleed, Burst, Fast ATK, Time Mastery",
        "profile": "Stable melee DPS.Deals massive Lightning DMG.Ultimate: Creates a lightning zone to boost DPS.",
        "leader": "Lethal Arts",
        "leaderEffect": "Team gains 24% Elemental DMG. Non-[[Kiana]], [[Mei]], or [[Bronya]] characters get an additional 30 SP upon switch entry.",
        "special": "Combo: Shadow Dragon",
        "specialEffect": "Link Six Fists stances into Combo ATKs.Ki Riptide: 140% + 180% ATK of Physical DMG.Ki Pulverize: 200% + 220% ATK of Physical DMG.Ki Seismic Slam: 100% ATK of Physical DMG.Shi-Ki Crescent: 180% ATK of Physical DMG if not fully charged or if SP is too low to enter Eclipse Mode.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Raging Tiger",
        "ultimateEffect": "At over 60 SP, casting Shi-Ki Crescent procs Lunar Eclipse mode that lasts up to 60s, spending 6 SP/s and -100% attack SP recovery, but deals +40% Lightning DMG.When Eclipse ends, recover 30% of initial SP when casting the skill.Burst: Enters Lunar Eclipse (burst mode) and launches Shi-Ki Crescent dealing 480% ATK of Physical DMG.Lunar Eclipse attacks:Six Fists: total of 860% ATK of Physical DMG.Shi-Ki Charged Palm: 180% + 240% ATK of Physical DMG.Shi-Ki Onslaught: 260% + 5 x 50% per combo hit + 340% ATK of Physical DMG.Shi-Ki Crescent: 320% ATK of Physical DMG.",
        "evasion": "Dark Sparrow",
        "evasionEffect": "Rapid evasive maneuver. Can be performed twice in a row.Not in Eclipse Mode: Within a  short duration after Ultimate Evasion, tap the Combo ATK button to dash to the enemy and unleash Ki Riptide.Eclipse Mode: Within a short duration after Ultimate Evasion, tap the Combo ATK button to unleash Shi-Ki Onslaught.Electrical Surge: Triggering an Ultimate Evasion deals 250% ATK of Lightning DMG against enemies within a large AOE; CD: 15s.",
        "basic": "Wasteland Panther",
        "basicEffect": "Use The Six Fists for battle.The Six Fists:1st Stance: 90% ATK of Physical DMG.2nd Stance: 90% ATK of Physical DMG.3rd Stance: 90% ATK of Physical DMG.4th Stance: 2 x 60% ATK of Physical DMG.5th Stance: 2 x 80% ATK of Physical DMG.6th Stance: 180% ATK of Physical DMG.",
        "name": "Shadow Knight"
    },
    "Silverwing: N-EX": {
        "character": "Bronya Zaychik",
        "version": "5.4",
        "rank": "S",
        "type": "BIO",
        "core_strengths": "Ice DMG, Fast ATK, Time Mastery, Gather, Aerial",
        "profile": "Ranged Ice DPS.Use Combo ATK and Ultimate to deploy a scatter barrier for burst ATKs and to boost DPS.",
        "leader": "Hyper Proxy",
        "leaderEffect": "Ice DMG dealt by team ranged attackers increases 24.0%; Total DMG dealt by team increases 20.0%.",
        "special": "Combo-Raze Effect",
        "specialEffect": "Attacks with rapid gun fire.Able to use when the next threshold is more than halfway charged, deploying a scatter barrier and firing a hail of bullets to deal 12 x 20% Ice DMG. If the bullets pass through the scatter barrier, Ice DMG increases by 24 x 20%.When a scatter barrier is present, the last blow of each Basic ATK grants a charge. If the barrier is broken, the charge is lost.With 2 charges, tap the [ATK] button to follow the last blow of a Basic ATK with a special Combo ATK dealing 500% Ice DMG. Continue tapping [ATK] after the Combo finishes to follow with the second blow of Basic aerial ATK or fourth blow of a Basic ground ATK. If the special Combo passes through the barrier, it deals 600% + 10 x 20% Ice DMG. Special Combo ATK triggers a global Time Fracture for 2.5s.Scatter barrier's duration doesn't decrease during the special Combo. Special Combo can be used twice while the barrier is present.",
        "passive": "N-EX Protocol",
        "passiveEffect": "Automatically receive passive skill bonuses.Deploy a max of 1 scatter barrier on the field. Next threshold is reduced 1 block/s while barrier is deployed. Regains 1 block/s while barrier is not present for a max 10 blocks.Global Time Fracture triggered for 3.5s when barrier is deployed. Next threshold cleared when barrier is destroyed. User's ATKs passing through barrier double.Barrier grants Basic ground ATKs the following enhancements:First hit: 4 x 100% Ice DMG.Second hit: 2 x 100% Ice DMG.Third hit: 2 x 100% + 7 x 20% Ice DMG.Fourth hit: 6 x 40% Ice DMG.Fifth hit: 2 x 220% Ice DMG and summons a black hole pulling in enemies, dealing 80% Ice DMG.Barrier grants Basic aerial ATKs the following enhancements:First hit: Deals 2 x 100% Ice DMG.Second hit: Deals 4 x 60% + 7 x 20% Ice DMG.Third hit: Deals 18 x 30% + 2 x 220% Ice DMG and summons a black hole pulling in enemies, dealing 80% Ice DMG.Scatter barrier can block monster's movement but not its ATK. When the duration timer finishes or Silverwing: N-EX leaves the field, the barrier is destroyed, increasing team Total QTE DMG by 30% for 8s.Only one bird bomb can be summoned at a time after the third hit of a Basic ground ATK and second hit of a Basic aerial ATK. Only one black hole can be summoned at a time after the last hit of a Basic ground ATK and Basic aerial ATK.",
        "ultimate": "Razing Chrome",
        "ultimateEffect": "Launches a powerful laser through a regulator for massive AoE DMG.When tapped:If grounded, get airborne dealing 100% Ice DMG. Tap ATK afterwards to follow with the second blow of a Basic ATK.Aerial: Return to the ground dealing 100% Ice DMG. Tap ATK afterwards to follow with the third blow of a Basic ATK.Getting airborne or grounded moves scatter barrier between you and the enemy hit last.If held: Perform Ultimate for 2500% Ice DMG.During Ultimate, user and enemy skill timers and stage timer are paused. Destroys barriers present on field. A scatter barrier is redeployed 10s after use.CD: 15s. SP cost: 75.",
        "evasion": "Stealth Mode",
        "evasionEffect": "Quickly dodges enemy ATKs, up to twice in a row. When dodging, the scatter barrier can be moved between the user and the last enemy hit. Scatter Barrier duration timer is paused while moved. CD: 0.5s. If dodging interrupts a basic ATK, tap ATK to continue basic ATK. When performing an Ultimate Evasion, use Ultimate Evasion Skill to open fire, dealing 10 x 20% Ice DMG. Bullets deal 20 x 20% Ice DMG passing through a scatter barrier. CD: 15s.",
        "basic": "Multi-Unit Arm 0019",
        "basicEffect": "Ranged attacks which inflict minor Rime Trauma.First Ground ATK deals 2 x 100% Ice DMG.Second Ground ATK deals 100% Ice DMG.Third Ground ATK deals 100% + 7 x 20% Ice DMG.Fourth Ground ATK deals 3 x 20% Ice DMG.Fifth Ground ATK deals 100% Ice DMG.First Aerial ATK Deals 100% Ice DMG.Second Aerial ATK Deals 50% + 50% + 7 x 20% Ice DMG.Third Aerial ATK Deals 9 x 20% + 100% Ice DMG. You can move during this time.During Basic ATKs and Combo ATKs, resistance to interruption increases while DMG received decreases by 50%.",
        "name": "Silverwing: N-EX"
    },
    "Sixth Serenade": {
        "character": "Kallen Kaslana",
        "version": "2.3",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Ice DMG, Freeze",
        "profile": "Mid-range DPS.Shuttle attack deals massive Ice DMG.",
        "leader": "Phantom Curtain",
        "leaderEffect": "Team gains 24% Elemental DMG and takes 22% less Elemental DMG.",
        "special": "Combo: Gloomy Dawn",
        "specialEffect": "Consume Nachtsicht to perform a Combo ATK.Tap [ATK] right after the 4-sequence basic attack to directly unleash a Combo ATK (does not consume Nachsicht), that deals 200% ATK of Physical DMG and inflicts a Raven Mark on the target.With at least 300 Nachtsicht, tap [ATK] after a Combo ATK, or hold [ATK] after the first 3-sequences of the Basic ATK to consume 300 to unleash another Combo ATK.Initial Nachtsicht: 100; max: 600.",
        "passive": "Passive",
        "passiveEffect": "Raven Mark: Special mark that can stack up to 3 times on the enemy.Marks can be stacked for the duration, or harvested from the enemy to deal the following effects:1 mark: after 5s, deal 100% ATK of Ice DMG.2 marks: after 5s, deal 200% ATK of Ice DMG and knock the enemy airborne.3 marks: applies Time Lock to the enemy and prevents them from dying within the period; after 2s, deal single target 200% + AOE 100% ATK of Ice DMG, and knocking enemies airborne and freezing them for 2s.",
        "ultimate": "Night Carnival",
        "ultimateEffect": "Unleash the Raven Cross and assume Raven Form.Deals 100% ATK of Ice DMG to enemies in the AOE and adds an empowered 3-stack Raven Mark, which can then be harvested after 4s to deal Single 600% + AOE 200% of Ice DMG. Knock enemies airborne after the attack.Character performs a multi-hit Shuttle ATK that deals 12 x 60% ATK of Ice DMG and assumes Raven Form while the Raven Cross immobilizes enemies in a large AOE.Raven Form: character recovers 15 Nachtsicht every 0.1s. Duration: 12s.SP cost: 125.",
        "evasion": "Raven Blitz",
        "evasionEffect": "Quickly evades enemy attacks. Can be performed twice in a row.Ultimate Evasion recovers 100 Nachtsicht.Raven Blitz: Triggered upon an Ultimate Evasion, dealing 80% ATK of Ice DMG against nearby enemies and adds 1 stack of Raven Mark; tap [ATK] button to perform a Combo ATK (does not consume Nachtsicht); CD: 15s.",
        "basic": "Twilight Nocturne",
        "basicEffect": "Unleashes 4-sequence Gun Kata attack.4-sequence Gun Kata attack:1st Sequence: 70% ATK of Physical DMG.2nd Sequence: 70% ATK of Physical DMG.3rd Sequence: (40% + 3 x 30% + 30% + 80%) ATK of Physical DMG.4th Sequence: 100% ATK of Physical DMG.The 2nd, 3rd, and the 4th Sequences each recovers 40 Nachtsicht upon hit.",
        "name": "Sixth Serenade"
    },
    "Snowy Sniper": {
        "character": "Bronya Zaychik",
        "version": "1.8",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Freeze",
        "profile": "Stable ranged DPS.QTE is easy to trigger.Ultimate freezes all enemies over a long time.",
        "leader": "Manchine Integration",
        "leaderEffect": "All team members' skill CD of Ultimate Evasion or Perfect Defense shortens by 3.0s.",
        "special": "Switch: Ice Phantom",
        "specialEffect": "Switch entry triggers Dimension Shift upon entering the battle.Instant Evasion: Triggers Dimension Shift effects.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "снег",
        "ultimateEffect": "Summons artic snow that freezes all enemies.Land of Frost: Freezes all enemies for 8s.Frigid Blast: When the freezing ends, deal 150% ATK of Ice DMG against enemies.SP Cost: 75.",
        "evasion": "Dimension Shift",
        "evasionEffect": "Temporarily enters another dimension to evade attacks.Frost Center: Deals 60% ATK of Ice DMG against the attacker.Ultimate Evasion: Freezes the attacker for 3s and slows the Move Speed and ATK Speed of the enemies nearby for 7s.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged cannon fire that deals greater DMG with higher charge sequence.Arm Switch: Charging mode changes with type of weapon equipped.",
        "name": "Snowy Sniper"
    },
    "Spina Astera": {
        "character": "Rita Rossweisse",
        "version": "5.5",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Fire DMG, Ignite, Time Mastery, Gather",
        "profile": "Melee burst DMG dealer.Charged ATK and Ultimate induce Astral Harness to enhance herself.Charged ATK deals high DMG in Astral Harness.",
        "leader": "Thuban: Circumpolar Star",
        "leaderEffect": "Combo/Charged ATKs from any team member deal 28.0% bonus Total DMG. With at least one non-MECH Valkyrie on the tam, team deals 34.0% bonus Fire DMG.",
        "special": "Charged ATK: Coma Berenices: Cluster",
        "specialEffect": "Charged ATK unleashes Void Vortex.At 600 Astrum, hold [ATK] to perform:Charged ATK - Astral Flare: Ignite: Induce Astral Harness state and unleash Void Vortex to deal 12 × 20% + 200% ATK of Fire DMG.In Astral Harness and with Void Vortex present, hold [ATK] to perform:Charged ATK - Astral Flare: Combust: Deal 4 × 30% ATK of Fire DMG and unleash Void Vortex EX to deal 12 × 30% ATK of Fire DMG.In Astral Harness and with Void Vortex EX present, hold [ATK] to perform:Charged ATK - Astral Flare: Erupt: Drive Void Vortex forward to gather enemies in a large area dealing 4 × 20% ATK of Fire DMG and unleash the final blow dealing 1,300% ATK of Fire DMG. Casting the Charged ATK ends Astral Harness and resets Astrum.",
        "passive": "Eridanus: Riverflow",
        "passiveEffect": "Passive bonuses apply automatically.In Normal state, recovers 80 Astrum per second (Max: 600).In Astral Harness state, loses 50 Astrum per second. Reverts to Normal state at 0 Astrum or switch-out.Spina Astera's Charged ATK in Astral Harness state generates Void Vortex that pulls enemies over a small area. All enemies are affected by Starshine Circle simultaneously.Upon exitig Astral Harness state, Void Vortex and Starshine Circle both cease.",
        "ultimate": "Pisces: Alrescha",
        "ultimateEffect": "Wield the might of the simulated Holy Blade to deal massive DMG.Spina Astera restores 600 Astrum and enters Astral Harness. She unleashes a massive Void Vortex using the simulated Holy Blade to deal 1,500% + 11 × 20% ATK of Fire DMG during which all skill timers and stage timer are paused. When Ultimate ends, a Void Vortex EX is created in front of Spina Astera.SP cost: 100. CD: 20s.",
        "evasion": "Andromeda: Nebula",
        "evasionEffect": "Evade enemy attacks up to twice in a row.Ultimate Evasion Skill: Triggers 3s of global Time Fracture and grants 5 stacks of Blazar if in Astral Harness. Also restores 200 HP if there are ignites enemies within Starshine Circle. CD: 15s.Tap [ATK] immediately after Ultimate Evasion to connect into Basic ATK SEQ 3.",
        "basic": "Canis Major: Sirius",
        "basicEffect": "Wields a scythe to attack and ignite enemies with the might of stars.Normal state:SEQ 1: Deals 80% ATK of Fire DMG and restores 10 Astrum.SEQ 2: Deals 40% + 100% ATK of Fire DMG and restores 5 + 15 Astrum.SEQ 3: Deals 40% + 100% ATK of Fire DMG and restores 10 + 15 Astrum.SEQ 4: Deals 3 × 20% + 100% ATK of Fire DMG and restores 3 × 5 + 20 Astrum.Astral Harness state:SEQ 1: 80% ATK of Fire DMG and bonus Astral Flare DMG once.SEQ 2: 40% + 100% ATK of Fire DMG and bonus Astral Flare DMG once.SEQ 3: 40% + 150% ATK of Fire DMG and bonus Astral Flare DMG twice.SEQ 4: 4 × 20% + 100% ATK of Fire DMG.SEQ 5: 150% + 300% ATK of Fire DMG.Astral Flare deals 30% ATK of Fire DMG each time.In Astral Harness, Basic ATK grants one stack of Blazar on hit and each stack makes the Astral Flare: Erupt thrust deal 30% ATK of Fire DMG. SEQ 1/2/3/4 of Basic ATK each grants 1 stack, and SEQ 5 grants 5 stacks. 20 stacks max. Casting Ultimate grants full stacks.Casting Astral Flare: Erupt or exiting Astral Harness resets Blazar.",
        "name": "Spina Astera"
    },
    "Starchasm Nyx": {
        "character": "Seele Vollerei",
        "version": "4.8",
        "rank": "S",
        "type": "QUA",
        "core_strengths": "Ice DMG, Freeze, Time Mastery, Burst",
        "profile": "Close-range Ice DMG dealer. Good at fighting multiple enemies.Charged ATKs deal considerable DMG.Ultimate activates Burst mode, during which she deals massive DMG with chain claws.",
        "leader": "A Torn Heart",
        "leaderEffect": "Team deals 24.0% more Ice DMG. With Bronya on the team, team's Charged ATKs deal 29.0% more Total DMG.",
        "special": "Condemning Blade",
        "specialEffect": "Hold [ATK] to perform a Charged ATK.In normal form, her Charged ATK consumes all Carmine Gashes, teleports her in front of the target and deals 300% ATK of Ice DMG.In Burst form, she can continuously consume Carmine Gashes to unleash Charged ATKs (each deals 2 x 270% ATK of Ice DMG) until she exhausts all of them, during which she has Iron Body. Each Charged ATK accelerates the next Charged ATK; Charged ATK Speed maxes after 3 Charged ATKs.During Burst form, casting Charged ATKs teleports her in front of enemies and activates her Ultimate Evasion skill Ceaseless Carousal.",
        "passive": "Hagridden Night",
        "passiveEffect": "Passive bonuses apply automatically.In normal form, the 1st, 2nd, 3rd and 4th sequences of Basic ATK each restores 1 Carmine Gash, and the 5th restores 2.In Burst mode, the 1st and 2nd sequences of Basic ATK each restores 1 Carmine Gash, and the 3rd and 4th each restores 2.Carmine Gash max out at 6. Each excessive Carmine Gash turns into 1 SP.During Burst, Nightmare Stage will take effect throughout.",
        "ultimate": "Moment of Collapse",
        "ultimateEffect": "Starchasm Nyx attacks with chain claws.Tap [ULT] to activate Burst mode, deal 700% ATK of Ice DMG and inflict one Quantum Implosion on QUA enemies.During Burst mode, Starchasm Nyx fights with her chain claws Blood & Love.1st Sequence: 360% ATK of Ice DMG2nd Sequence: 440% ATK of Ice DMG3rd Sequence: 660% ATK of Ice DMG4th Sequence: 780% ATK of Ice DMGDuring Burst mode, tap [ULT] again to unleash Time of Metamorph, dealing 900% ATK of Ice DMG and end Burst, during which all skill timers (for self and enemies) and the stage timer are temporarily suspended.Activation cost: 75 SP. CD: 12s. CD starts after Time of Metamorph.Burst lasts for up to 17s and ends when Starchasm Nyx leaves the field.",
        "evasion": "Aria of Torment",
        "evasionEffect": "Quickly dodge enemy attacks up to twice in a rowPerforming an Ultimate Evasion triggers Ultimate Evasion skill Ceaseless Carousal.[Ceaseless Carousal]: Triggers a 3s global Time Fracture and restores 1 Carmine Gash.In normal form, tap [ATK] to connect into the 4th sequence of Basic ATK. CD: 15s.",
        "basic": "Anguished Cry",
        "basicEffect": "Starchasm Nyx wields her scythe to attack.1st Sequence: 50% ATK of Physical DMG + 80% ATK of Ice DMG2nd Sequence: 70% ATK of Physical DMG + 120% ATK of Ice DMG3rd Sequence: 100% ATK of Physical DMG + 180% ATK of Ice DMG4th Sequence: 35% x (4 ~ 8) ATK of Ice DMG according to the duration of the attack pause, and pulls in surrounding enemies for a short time.5th Sequence: 460% ATK of Ice DMG.",
        "name": "Starchasm Nyx"
    },
    "Starlit Astrologos": {
        "character": "Theresa Apocalypse",
        "version": "4.0",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Time Mastery, Stun, Gather, Heal",
        "profile": "Powerful Physical Support.Joins the battle with QTE without switching in to support teammates.Ultimate greatly boosts teammates' DPS and can be unleashed on standby.",
        "leader": "Nine Palaces",
        "leaderEffect": "Teammates gain 15.0% Crit Rate for 10s after unleashing Charged ATKs. If the team is formed by 3 battlesuits of 3 different Types, all members gain 30.0% Total DMG.",
        "special": "Combo: Black Tortoise",
        "specialEffect": "Hold [ATK] for a mighty blow.After the 3rd sequence of Basic ATK, hold [ATK] to unleash a Combo ATK that deals 400% ATK of Physical DMG. With Three Rites unlocked, release [ATK] at the right moment for Perfect Cast.",
        "passive": "Azure Dragon",
        "passiveEffect": "Passive bonuses apply automatically.When hitting an enemy, teammates obtain 1 stack of Hexagram with a 1s CD. Stacks are shared across the team. Taking a hit reduces 1 stack with a 3s CD. Starlit Astrologos' death removes all stacks and no stacks can be obtained after.",
        "ultimate": "Eight Formations",
        "ultimateEffect": "Summon a tornado to sweep the battlefield.Deploy a formation with a whirling tornado, gathering enemies at the tornado eye and dealing 20 x 100% ATK of Physical DMG in total. SP Cost: 125. CD: 25s.",
        "evasion": "White Tiger",
        "evasionEffect": "Step sideways to dodge attacks. Can be performed twice in a row.White Tiger: Ultimate Evasion triggers a 2s global Time Fracture. CD: 15s.Tap [ATK] upon White Tiger to perform Combo ATK.",
        "basic": "Rosefinch",
        "basicEffect": "Launch fan attacks. Evading during the first 3 sequences will not break the sequence connection.1st sequence: 80% + 80% ATK of Physical DMG.2nd Sequence: 100% + 100% ATK of Physical DMG.3rd sequence: 4 x 60% ATK of Physical DMG.4th sequence: 120% + 120% ATK of Physical DMG.",
        "name": "Starlit Astrologos"
    },
    "Stygian Nymph": {
        "character": "Seele Vollerei",
        "version": "3.5",
        "rank": "S",
        "type": "QUA",
        "core_strengths": "Physical, Heavy ATK, Time Mastery",
        "profile": "White form: Melee AOE DPS.Dark form: Physical Burst with Heavy ATKs.Pass through enemies to actively trigger the Evasion.",
        "leader": "Cursed Blessing",
        "leaderEffect": "Team gains 14% Crit Rate. With 3 members of different types, team gains 21% bonus Physical DMG.",
        "special": "Charged ATK: Day and Night",
        "specialEffect": "Hold [ATK] during Basic ATK, evasion, or QTE to unleash Charged ATK.Saule: 2 x 150% ATK of Physical DMG.Consume 400 Saulian Ego when it maxes to inflict Sunnebrand upon hit and resonate with the mark to deal 400% Physical AOE DMG.Veliona: 2 x 50% + 300% ATK of Physical DMG and inflict Veilmark upon hit. Consume 400 Veilmarks when it maxes to resonate with all Veilmarks, dealing 500% ATK of Physical DMG.With full Saulian Ego or Veilian Id, tap [ATK] after last sequence of Basic ATK to auto perform Charged ATK.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Saulian Ego & Veilian Id share a meter of 400 points; One waxes and the other wanes.Sunnebrand & Veilmark, each lasts for 20s.",
        "ultimate": "Chthonic Fury",
        "ultimateEffect": "Saule transforms into Veliona and vice versa.Inflicts Quantum Implosion on QUA enemies.Cast by Saule: Briefly gathers and immobilizes nearby enemies for 4s, dealing 1,000% + 7 x 100% of ATK of Physical DMG; awakens Veliona, recovers 400 Veilian Id, and inflicts Veilmark on enemies to replace Sunnebrand.Cast by Veliona: Deals 500% + 2,500% ATK of Physical DMG; awakens Saule, recovers 400 Saulian Ego, and inflicts Sunnebrand on enemies to replace Veilmark.CD: 25s. Can be activated at any SP, but will consume all SP upon activation. For every SP consumed, boosts Ultimate's Total DMG by 0.5% (75% max).",
        "evasion": "Flash of Eternity",
        "evasionEffect": "Quickly evades attacks. Can be performed twice in a row.Saule's Ultimate Evasion recovers 100 Saulian Ego, enabling Saule to pass through enemies and directly perform the 4th sequence of her Basic ATK until the Evasion ends;Veliona's Ultimate Evasion recovers 100 Veilian Id, enabling Veliona to pass through enemies when evading forward, and directly perform the 4th sequence of her Basic ATK until Evasion ends.Flash of Eternity: Ultimate Evasion triggers a 3s global Time Fracture (CD: 15s). Flash of Eternity recovers 400 Saulian Ego for Saule and 400 Veilian Id for Veliona.",
        "basic": "Light and Dark",
        "basicEffect": "Saule/Veliona basic ATK.Saule:1st Sequence: 80% + 100% ATK of Physical DMG; recovers 50 Saulian Ego upon hit.2nd Sequence: 120% ATK of Physical DMG; recovers 50 Saulian Ego upon hit.3rd Sequence: 100% + 2 x 60% ATK of Physical DMG; recovers 50 Saulian Ego upon hit.4th Sequence: 80% + 120% ATK of Physical DMG; recovers 50 Saulian Ego upon hit.5th Sequence: 3 x 150% + 200% ATK of Physical DMG; recovers 50 Saulian Ego upon hit.Veliona:1st Sequence: 120% ATK of Physical DMG; recovers 50 Veilian Id upon hit.2nd Sequence: 2 x 100% + 2 x 120% ATK of Physical DMG; recovers 50 Veilian Id upon hit.3rd Sequence: 300% ATK of Physical DMG; recovers 50 Veilian Id upon hit.4th Sequence: 3 x 150% ATK of Physical DMG; recovers 50 Veilian Id upon hit.Veliona's tentacle attacks immobilize enemies for 1s upon hit.",
        "name": "Stygian Nymph"
    },
    "Swallowtail Phantasm": {
        "character": "Seele Vollerei",
        "version": "3.2",
        "rank": "A",
        "type": "QUA",
        "core_strengths": "Physical, Burst",
        "profile": "Melee AOE DPS.Enters Warp State after evading enemy attack.Burst mode: DPS spike. Ultimate Evasion extends Burst duration.",
        "leader": "Azure Nymph",
        "leaderEffect": "Team gains 14% Crit Rate in Burst mode. If [[Bronya]] is in the team, team also gains 10% Total DMG Multiplier.",
        "special": "Charged: Fluttering Ripple",
        "specialEffect": "Charged ATK can be performed during Basic ATKs.Tap and hold [ATK] during the Basic ATK sequence to deal 4 x 150% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Veil is maxed at 500.",
        "ultimate": "Veliona's Torrent",
        "ultimateEffect": "Assume the powers of the Shadow Avatar and enter Burst Mode.Perform a multi-sequence shuttle ATK to deal 6 x 150% ATK of Physical DMG, gain Avatar powers to deal 2 x 200% + 600% ATK of Physical DMG, then enter burst mode to get 250 Veil.Final blow applies Veliona's Binding and one Quantum Implosion against QUA enemies.Burst: Gain crit multiplier for Basic ATK and 50% Total DMG Reduction. Tap and hold [ATK] to spend an evasion to deal a special shuttle ATK and trigger Plane Warp.Cost: 30 Veil per 0.5s. Max duration: 18s.CD: 25s. SP cost: 125.",
        "evasion": "Blinking Flash",
        "evasionEffect": "Evades enemy attack. Can be performed twice in a row.Recovers 30 Veil upon Ultimate Evasion.Plane Warp: In non-Burst mode, enters Phase Warp State (lasts 3s) upon Ultimate Evasion and can directly unleash the 4th Sequence of Basic ATK, during which the Valkyrie gains 20% Total DMG Reduction and can shuttle through enemies;Burst mode bonus: additionally gains 30 Veil and performs a special shuttle ATK that deals 2 x 60% + 2 x 100% + 480% ATK of Physical DMG and inflicts Velonia's Binding that reduces 40% Move Slow. CD: 15s.Velonia's Binding overrides Vibration Mode until Burst mode ends. Max duration: 6s.",
        "basic": "Spear of Phantasos",
        "basicEffect": "5-sequence sweeping scythe attack.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 80% + 100% ATK of Physical DMG.3rd Sequence: 2 x 60% + 120% ATK of Physical DMG.4th Sequence: 120% + 160% ATK of Physical DMG.5th Sequence: 2 x 80% + 240% ATK of Physical DMG.Recovers 15 Veil when Basic ATKs hits any enemy.",
        "name": "Swallowtail Phantasm"
    },
    "Sweet 'n' Spicy": {
        "character": "Carole Pepper",
        "version": "5.3",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Time Mastery, Aerial, Gather, Stun",
        "profile": "MECH-type melee Physical support.Charged ATK dealshigh DMG to shields.Ultimate buffs teammates on the field after she is switched out.",
        "leader": "Star of Hope",
        "leaderEffect": "Charged ATKs deal 10.0% bonus Total DMG. Team's melee Physical DMG increase by 10.0%.",
        "special": "Charged ATK: Kissy Pillow Serious Punch",
        "specialEffect": "Charge for varying durations to perform different attacks.Hold [ATK] to charge, during which Valkyrie takes 80% less Total DMG and has Iron Body. Short charge and long charge result in different attacks.Charged ATK I: 300% ATK of Physical DMG.Charged ATK II: 450% ATK of Physical DMG.Charged ATK III: 700% ATK of Physical DMG.When casting Charged ATK in mid-air, enemies nearby are gathered and take 20% ATK of Physical DMG during charging.Aerial Charged ATK I: 225% ATK of Physical DMG.Aerial Charged ATK II: 700% ATK of Physical DMG.",
        "passive": "Amazing Carole",
        "passiveEffect": "Passive bonuses apply automatically.At 3 stacks of Armor Shredder, the next Charged ATK consumes all stacks and induces Amazing Carole state for 15s. Triggering it again resets the duration. When Sweet 'n' Spicy is switched out in Amazing Carole state, the switched-in teammate obtains the same enhancements.",
        "ultimate": "Kissy Pillow ☆ Burst",
        "ultimateEffect": "Bash enemies twice and leap up to deal AoE DMG.Hold ULT to use your Ultimate, triggering a global Time Fracture for 5 seconds. During that time, bash enemies twice dealing 1200% ATK of Physical DMG and leap up to slam the ground dealing 1000% ATK of Physical DMG in a large area and knocking enemies airborne. Can be cast in mid-air.SP cost: 50. CD: 20s.",
        "evasion": "Arahato Mobility",
        "evasionEffect": "Quickly dodge enemy attacks.Can be connected into Thrust Punch dealing 75% ⨯ 2 ATK of Physical DMG, and further connected into the Basic ATK SEQ 3.Ultimate Evasions trigger Ultimate Evasion Skill: Thrust Punch EX, which triggers 3s of global Time Fracture and can be connected into Ultimate Evasion ATK to deal 150% ⨯ 2 ATK of Physical DMG.Up to 2 evasions in a row on the ground. CD: 15s. Only 1 evasion allowed in mid-air but it resets aerial Charged ATK.",
        "basic": "Kissy Pillow Strikes",
        "basicEffect": "Fist attacks.SEQ 3 grants 1 stack of Armor Shredder (3 stacks max).3-hit ground Basic ATK: 150 + 150% + 250% ATK of Physical DMG.Upward Thrust: 250% + 75% ⨯ 3 ATK of Physical DMG.Downward slam: 150% + 200% ⨯ 2 ATK of Physical DMG.",
        "name": "Sweet 'n' Spicy"
    },
    "Sündenjäger": {
        "character": "Kallen Kaslana",
        "version": "2.6.5",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Impair, Fast ATK",
        "profile": "Mid-range AOE DPS.Strong DPS potential.Excellent self-healing.",
        "leader": "Kindred's Link",
        "leaderEffect": "Team gains 10% Move SPD. MECH-type characters gain 5% Attack Speed.",
        "special": "Combo: Purifier's Brand",
        "specialEffect": "Unleash a powerful shot after the 1st sequence of the Basic ATK:Power Shot: 300% ATK of Physical DMG against targets along a straight line; targets hit will be marked with a Hunted Brand for 13s.",
        "passive": "Passive",
        "passiveEffect": "Character automatically gains passive bonuses.Upon performing an Ultimate Evasion, character gains a continuous Holy Brand effect for 60s. If another Ultimate Evasion is triggered during that duration, the mark will be cleared and the character will receive a Holy Salve effect for 10s. If the character HP is below 30% of max HP, then quickly heal 200 HP/s.",
        "ultimate": "Barrage Macabre",
        "ultimateEffect": "Suit up in a powered battlesuit to unleash raw devastation.Powered Battlesuit: Tap and hold the [ATK] button to continuously attack enemies in front of you.Autorifle Attack: Deals 50% ATK of Physical DMG and impairs enemies (if not yet impaired), reducing their DEF by 50% for 10s.Missile Attack: Deals 50% ATK of Physical DMG.Restructure: During Ultimate, if character HP is below 25% max HP, then heal 200 HP/s. Character cannot be killed throughout the skill duration, but will also be unable to switch for other characters.SP cost: 125; CD: 30s; Ultimate Skill duration: 10s.",
        "evasion": "Kindred's Feint",
        "evasionEffect": "Quickly evade enemy attacks. Can be performed twice in a row.Shadow: Upon performing an Ultimate Evasion, deals 200% ATK of Physical DMG against nearby enemies and inflicts a 13s Hunted Mark.Holy Brand: Gained upon an Ultimate Evasion, boosting Physical DMG by 15% for 10s; CD: 15s.Follow-up: Tap [ATK] within 3s after an Ultimate Evasion to immediately cast Sturmgeschütz.",
        "basic": "Nocturnal Cantata",
        "basicEffect": "Activates Sturmgeschütz attack after the 3 Basic ATK sequences.The direction of Sturmgeschütz can be controlled using the joystick.1st sequence: 2 x 40% ATK of Physical DMG.2nd sequence: 2 x 40% ATK of Physical DMG.3rd sequence: 2 x 50% ATK of Physical DMG.Sturmgeschütz: Deals 4 x 50% ATK of Physical DMG and impairs the targets (if not yet impaired), reducing their DEF by 50% for 10s.Sturmgeschütz deals 100% x 2 ATK of Physical DMG against all enemies with a Hunted Brand within a 10m range. If there are no more than 3 enemies on the battlefield, Sturmgeschütz will deal 200% x 2 ATK of Physical DMG instead.",
        "name": "Sündenjäger"
    },
    "Umbral Rose": {
        "character": "Rita Rossweisse",
        "version": "2.8",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Time Mastery",
        "profile": "Melee AOE DPS.Charged ATK costs HP but deals massive DMG.Ultimate: High AOE Physical DMG and causes knockback.",
        "leader": "Rosette Runners",
        "leaderEffect": "Whole Team gains 16.0% faster attack speed. PSY-type characters: Ultimate skills gain 21.0% Total DMG Multiplier.",
        "special": "Charge: Rosy Funeral",
        "specialEffect": "Throw a Spirit Scythe to deal ranged DMG by charging during any sequence of the Basic ATK.At full Umbra, tap and hold the [ATK] button during any attack to throw a spinning Thorny Scythe that deals up to 8 x 100% ATK of Physical DMG while consuming all Umbra 15% of the character's Max HP (Thorny Scythe HP loss will not lead to death, but will trigger Rosemary). The character then enters a Rosy State for 6s, during each hit of Basic ATK or Ultimate heal her for 0.5% HP. Rosy State ends after the character receives healing from 40 hits.Switch: Performs an empowered form of the 3rd Sequence that deals 120% + 180% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Character automatically gain passive bonuses.Umbra: Start battle with 800 Umbra and recovers 50 Umbra per second up to a max of 800.Umbra recovery:Last strike of the 2nd Basic ATK sequence: 80.Last strike of the 5th Basic ATK sequence: 120.Last strike of the Ultimate: 160.",
        "ultimate": "Reaper of Weeds",
        "ultimateEffect": "Attack the enemy with a 7-sequence Flash Attack that deals a total of 16 x 50% ATK AOE Physical DMG. Enemies hit suffer a short Time Slow. Then throw a spinning scythe to create a cyclone that deals 10 x 40% ATK of Physical DMG and adds 2 Laceration stacks to the enemy. Once the cyclone ends, the character then swings her scythe over a large AOE to deal 800% of ATK of Physical DMG.CD: 20s. SP cost: 100.",
        "evasion": "Iris Blink",
        "evasionEffect": "Quickly evades enemy attacks. Can be performed twice in a row.Recovers 50 Umbra upon performing an Ultimate Evasion and gains 40% Move Speed for 3s.Iris Blink: Ultimate Evasions trigger a Time Fracture that slows all enemies for 2s. Tap [ATK] button to immediately perform a Shuttle ATK (the 4th Sequence of the Basic ATK) and recover up to 150 Umbra; CD: 15s.",
        "basic": "Thorns",
        "basicEffect": "5-sequence scythe sweeps.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 50% + 4 x 18% + 120% ATK of Physical DMG.3rd Sequence: 50% + 60% ATK of Physical DMG.4th Sequence: 3 x 40% + 5 x 30% ATK of Physical DMG.5th Sequence: 150% + 200% ATK of Physical DMG.The last hit of the 2nd and 5th Sequences adds a Laceration status to the enemy for 5s. Laceration can stack up to 2 times; gaining additional stacks resets the duration. Attacks against an enemy with ''1''/2 Laceration stack(s) deal 10%/20% more Total DMG.",
        "name": "Umbral Rose"
    },
    "Valkyrie Accipiter": {
        "character": "Fu Hua",
        "version": "2.2.5",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Stun, Heal, Time Mastery",
        "profile": "Team healing.Boosts team shield breaking efficiency.Stuns enemies to set up DPS spike.",
        "leader": "Chelonic Unity",
        "leaderEffect": "When Combo Hit Count exceeds 30, [[Mei]] and [[Kiana]] in the team gain 22% Crit Rate; When Combo Hit Count is below 30, [[Bronya]] in the team gains 28% Crit DMG.",
        "special": "Combo: Azure Dragon",
        "specialEffect": "Link the various Six Fists stances into different Combo ATKs.Ki Shattering Fist: 2 x 100% + 150% ATK of Physical DMGKi Zenith: When unlocked, 7 x 30% + 100% ATK of Physical DMG.Ki Barrage: 80% ATK of Physical DMG for each hit.Ki Nova: Full charge launches a penetrating blast wave dealing 3 x 80% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Amber Dragon",
        "ultimateEffect": "Consumes 25 Sp to unleash a Burst Combo ATK.Ki Avalanche: 350% ATK of Physical DMGKi Impact: 400% ATK of Physical DMGKi Nova EX: 3 x 150% ATK of Physical DMG.",
        "evasion": "Vermilion Dance",
        "evasionEffect": "Rapid movement to evade attacks.For a short period after using Ultimate Evasion, tap the Combo button to dash to the enemy and unleash a brutal smash, dealing 300% ATK of Physical DMG.Time Fracture: Ultimate Evasion triggers Time Fracture, slowing all enemies for 3s. CD: 15s.",
        "basic": "Whitetiger Dashing",
        "basicEffect": "Use the Six Fists for battle.The Six Fists:1st Stance: 80% ATK of Physical DMG.2nd Stance: 80% ATK of Physical DMG.3rd Stance: 80% ATK of Physical DMG.4th Stance: 2 x 100% ATK of Physical DMG.5th Stance: 2 x 80% ATK of Physical DMG.6th Stance: 150% ATK of Physical DMG.",
        "name": "Valkyrie Accipiter"
    },
    "Valkyrie Bladestrike": {
        "character": "Raiden Mei",
        "version": "1.8",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Burst, Fast ATK, Time Mastery",
        "profile": "High melee DPS and suppression.Excels against solo enemies.Deals massive DMG to enemies knocked airborne.",
        "leader": "Sakura Aura",
        "leaderEffect": "Team gains 25% DEF in battle. BIO-type characters gain 5% Max HP.",
        "special": "Combo: Void Edge",
        "specialEffect": "Slash flurry attack.Each Sequence: 210% ATK of Physical DMG.Fatal Slash: 260% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Susanoo",
        "ultimateEffect": "Activates Valkyrie's burst mode and consumes SP.Burst: Consumes SP continuously to enhance all forms of attack.At over 100 SP, consumes 20 SP to activate and 10 SP/s afterwards until SP is depleted; max duration: 60s.",
        "evasion": "Phantom Blade",
        "evasionEffect": "Quick dash to evade enemy attacks.Time Fracture: Triggers upon an Ultimate Evasion and lasts for 3s. CD: 15s.",
        "basic": "Gokiketsu",
        "basicEffect": "AOE penta-slash.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 80% ATK of Physical DMG.3rd Sequence: 100% ATK of Physical DMG.4th Sequence: 100% ATK of Physical DMG.5th Sequence: 250% ATK of AOE Physical DMG.",
        "name": "Valkyrie Bladestrike"
    },
    "Valkyrie Chariot": {
        "character": "Bronya Zaychik",
        "version": "1.8",
        "rank": "B",
        "type": "PSY",
        "core_strengths": "Physical, Gather, Ignite, Time Mastery",
        "profile": "Stable ranged DPS.Powerful support and control skills.Ultimate has low cost and long duration.",
        "leader": "Reactive Armor",
        "leaderEffect": "Team takes 20% less Ranged Physical DMG.",
        "special": "Switch: Gravity Shatter",
        "specialEffect": "Switch entry immediately unleashes a ground breaking attack.Ground Smasher: 150% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Character automatically gain passive bonuses.",
        "ultimate": "Grav Singularity",
        "ultimateEffect": "Summons a powerful black hole that draws in surrounding enemies.Black Hole: Lasts for 10s, during which the caster is invincible.Gravitational Collapse: Affected enemies significantly lose Ignore Interrupt and deal 50% less Total DMG.SP Cost: 50.After unleashing the Ultimate, character switch is allowed, but Valkyrie Chariot will stay on battlefield during her Ultimate.",
        "evasion": "Dimension Shift",
        "evasionEffect": "Enters temporary Dimension Shift to evade attacks.Time Fracture: Triggers Time Fracture upon an Ultimate Evasion, slowing all enemies for 5s. CD: 15s.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged cannon fire that deals greater DMG with higher charge sequence.Arm Switch: Charging mode changes with type of weapon equipped.",
        "name": "Valkyrie Chariot"
    },
    "Valkyrie Gloria": {
        "character": "Durandal",
        "version": "3.8",
        "rank": "A",
        "type": "QUA",
        "core_strengths": "Fire DMG, Ignite, Time Mastery",
        "profile": "Close-range Fire DMG dealer. Charges at enemies to attack.Ultimate deals massive Fire DMG.Capable of controlling enemies with her Throw skill.",
        "leader": "Praefect Equites",
        "leaderEffect": "Grants 30.0% bonus Fire DMG. Throws deal 17.0% bonus total DMG.",
        "special": "Charged ATK: Impetus Gloria",
        "specialEffect": "Tap & hold [ATK] to unleashed Charged ATKs.At least 240 Resolve: Hold [ATK] to gain Adamance and Iron Body after 0.6s and enter Sprint Stage 1, where each hit costs 40 Resolve and deals 50% ATK of Physical DMG & 80% ATK of Fire DMG.Consume at least 240 Resolve to enter Sprint Stage 2, where Fire DMG of each hit rises to 100% ATK.Consume at least 240 Resolve: Release [ATK] to launch Sprint ATK dealing 100% ATK of Physical DMG & 450% ATK of Fire DMG, or perform 1st sequence of Basic ATK otherwise.While in Aura Ignis with over 240 Resolve, hold [ATK] to consume all Resolve for Decisive Blow dealing 8 x 60% + 350% ATK of Fire DMG & 200% ATK of Physical DMG. Every Resolve consumed boosts total DMG by 0.2%.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonus apply automatically.Resolve: Starts at 240 and maxes at 480.",
        "ultimate": "Eruptio Magnifica",
        "ultimateEffect": "Unleashes a Might Blow with a massive lance.Leap towards the target and pull in nearby enemies for a  short duration, dealing 2 x 300% ATK of Physical DMG + 2 x 300% ATK of Fire DMG, then hurl a massive lance to further deal 500% ATK of Physical DMG + 1800% ATK of Fire DMG and inflict Quantum Implosion on QUA enemies. This generates an Aura Ignis covering the entire field, in which Basic ATKs and Throw Counters recover twice the Resolve and Valkyrie gains higher Ignore Interrupt for 15s.Activation cost: 100 SP. CD: 25s.",
        "evasion": "Augur Martialis",
        "evasionEffect": "Quickly evade enemy attacks. Can be performed twice in a row.Tap [ATK] upon Ultimate Evasion to directly unleash the 5th sequence.Augur Martialis: Restores 120 Resolve and triggers Time Fracture for 3s. CD: 15s.",
        "basic": "Hasta Domina",
        "basicEffect": "Five-sequence lance attacks.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 140% ATK of Fire DMG + 120% ATK of Physical DMG.3rd Sequence: 160% + 80% ATK of Fire DMG.4th Sequence: 4 x 60% ATK of Fire DMG.5th Sequence: 200% ATK of Physical DMG + 300% ATK of Fire DMG.The 2nd, 4th, and 5th sequences restore 40 Resolve on hit.",
        "name": "Valkyrie Gloria"
    },
    "Valkyrie Pledge": {
        "character": "Theresa Apocalypse",
        "version": "2.2.1",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Lightning DMG, Paralyze, Time Mastery, Fast ATK",
        "profile": "Mid-ranged crowd control.Basic ATKs: Good AOE and SP recovery.Use weapon skills to boost DPS.",
        "leader": "Our Pledge",
        "leaderEffect": "Shortens duration of most debuffs by 25% for the team. PSY-type characters gain 15% Elemental DMG.",
        "special": "Charge: Piercing Spear",
        "specialEffect": "Charge during the 4-sequence Basic ATK to launch a piercing attack.Piercing Spear: Charge by holding the [ATK] button during the 4-sequence Basic ATK.Reaches full charge in a short time, then release the [ATK] button to deal 3 x 135% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Spearsss",
        "ultimateEffect": "Throws a spear into the air that transforms into a rain of holy javelins.Spearsss: Deals total Physical DMG equal to 25 x 75% of ATK.SP Cost: 75.",
        "evasion": "Time Refuge",
        "evasionEffect": "Quick sideways dodge to evade enemy attack. Can be triggered 2 times in a row.After Ultimate Evasion, gain 40% Move Speed for 3s.Time Fracture: Triggers Time Fracture upon an Ultimate Evasion, slowing all enemies for 3s. CD: 15s.",
        "basic": "Spear of Brionac",
        "basicEffect": "Basic ATK: Mid-range 4-sequence attack using ethereal light lances.1st Sequence: 3 x 30% ATK of Physical DMG.2nd Sequence: 3 x 30% ATK of Physical DMG.3rd Sequence: 4 x 45% ATK of Physical DMG.4th Sequence: 3 x 75% ATK of Physical DMG against enemies within a large AOE.",
        "name": "Valkyrie Pledge"
    },
    "Valkyrie Ranger": {
        "character": "Kiana Kaslana",
        "version": "1.8",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Gather, Bleed",
        "profile": "Stable ranged DPS.Support and control skills.Excellent solo performance.",
        "leader": "Flying Comet",
        "leaderEffect": "Team gains 10% Move Speed. MECH-type characters gain 5% Attack Speed.",
        "special": "Combo: Aerolite Impact",
        "specialEffect": "Fires a Power Shot after 3 consecutive shots.Power Shot: 350% ATK of Physical DMG to all targets in a straight line.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Gungnir Fire",
        "ultimateEffect": "Summons a Valkyrie heavy cannon to blast away at enemies before her.Uncanny Cannon: Up to 1,200% of ATK of Physical DMG.SP Cost: 50.",
        "evasion": "Singularity",
        "evasionEffect": "Quickly cartwheels away to evade enemy attacks. Can be performed twice in a row.Energy Black Hole: Triggers upon an Ultimate Evasion. Lasts for 2s, during which it pulls in enemies nearby. CD: 10s.",
        "basic": "Gyrodrive Kata",
        "basicEffect": "Fire 4 shots in rapid succession.1st Shot: 100% ATK of Physical DMG.2nd Shot: 100% ATK of Physical DMG.3rd Shot: 150% ATK of Physical DMG.4th Shot: 250% ATK of Physical DMG.",
        "name": "Valkyrie Ranger"
    },
    "Valkyrie Triumph": {
        "character": "Murata Himeko",
        "version": "1.8",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "Physical, Heavy ATK, Time Mastery, Stun, Heal",
        "profile": "Melee DPS with heavy and light attacks.Good enemy suppressor.Ultimate: Massive burst DMG, crowd control, and healing.",
        "leader": "Triumph",
        "leaderEffect": "All characters in the team gain 15% Physical DMG at above 80% HP. BIO-type characters gain 25% DEF.",
        "special": "Valkyrie Charge",
        "specialEffect": "Unleash a Windmill Cleave attack when sprinting.Tap the [ATK] button while sprinting to unleash a jumping cleave, dealing 450% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Blade Field",
        "ultimateEffect": "Creates a sword rain enchant.Time Field: Lasts for 8s. Inflicts Time Slow to affected enemies.Field Shatter: Explosion deals 800% ATK of Physical DMG.SP Cost: 125.",
        "evasion": "Shock Wave",
        "evasionEffect": "Sideway dodge to evade enemy attacks. Can be triggered 2 times in a row.Energy Charge: Directly unleash 1st Charged Attack after Ultimate Evasion.Wave Blast: Releases a shock wave at original position after Ultimate Evasion, stunning all enemies within the AOE. Lasts for 2s. CD: 20s.",
        "basic": "Charge: Heavy Sword",
        "basicEffect": "Basic ATK: 3-sequence Zweihander Fechten. Each sequence can be charged for enhanced power.1st Sequence: 150% ATK of Physical DMG.2nd Sequence: 180% ATK of Physical DMG.3rd Sequence: 250% ATK of Physical DMG.1st Charged Strike: 200% + 300% ATK of Physical DMG.2nd Charged Strike: 250% + 400% ATK of Physical DMG.3rd Charged Strike: 320% + 440% ATK of Physical DMG.",
        "name": "Valkyrie Triumph"
    },
    "Vermilion Knight: Eclipse": {
        "character": "Murata Himeko",
        "version": "2.8",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Fire DMG, Ignite",
        "profile": "Stable melee DPS.Massive Fire DMG.Ultimate: Large AOE DMG.",
        "leader": "Vermilion Mark",
        "leaderEffect": "For the team, switch skills & QTEs deal 21% Total DMG; Ultimates deal 21% Total DMG. Team deals 30.0% bonus Fire DMG if formed by 3 different-type battlesuits.",
        "special": "Charge: Meteoric Assault",
        "specialEffect": "When not in Overdrive status, tap and hold the [ATK] button during 4-sequence Basic ATK and Guren Flash to deliver a Charged ATK.Charged ATK: Charges towards the target enemy, dealing 2 x (50% ATK of Physical DMG + 150% ATK of Fire DMG). Finally, unleash a Schielhau cross-cut that deals 300% ATK of Physical DMG + 750% ATK of Fire DMG.After performing a Charged ATK, use another Charged ATK within 6s to enter Overdrive status for 13.5s.",
        "passive": "Passive Skill",
        "passiveEffect": "Character automatically gains passive bonuses.Overdrive status: Cannot use Charged ATK, perform 2 consecutive Evasions, or recover SP from Basic ATKs. Unleash Ultimate to end Overdrive status.",
        "ultimate": "Annihilating Flames",
        "ultimateEffect": "Unleash a devastating assault with a flaming greatsword and burn everything within sight. Overdrive status ends once the skill is complete.The Ultimate skill has 4 charges. 1 charge is consumed with every usage of the skill. With more than 0 charge, tap the [Ultimate] button before the Ultimate finishes to keep performing the skill. Re-activating the skill will unleash a 2-sequence attack.1st Sequence: Deals 2 x (250% ATK of Fire DMG + 50% ATK of Physical DMG) + 400% ATK of Fire DMG + 50% ATK of Physical DMG.2nd Sequence: Deals 2 x (200% ATK of Fire DMG + 50% ATK of Physical DMG) + 350% ATK of Fire DMG + 50% ATK of Physical DMG + 1000% ATK of Fire DMG.",
        "evasion": "Guren Flash",
        "evasionEffect": "Quickly evade enemy attacks. Can be performed 2 times in a row.Guren Flash: Triggered upon Ultimate Evasion and reduces CD of Ultimate by 5s. Tap the [ATK] button again to charge towards the target enemy and deal: 100% ATK of Physical DMG + 450% ATK of Fire DMG + 150% ATK of Physical DMG.CD: 15s.",
        "basic": "Iron of Twilight",
        "basicEffect": "4-sequence attack.1st Sequence: 3 x 30% ATK of Fire DMG.Vermilion Knight will quickly start sprinting once she starts to move. During sprinting, the 1st Sequence will turn into a Sprint ATK with increased Interrupt and Ignore Interrupt.2nd Sequence: 50% ATK of Fire DMG + 100% ATK of Physical DMG.3rd Sequence: 2 x 100% ATK of Physical DMG + 50% ATK of Fire DMG.4th Sequence: 150% ATK of Fire DMG + 250% ATK of Physical DMG.",
        "name": "Vermilion Knight: Eclipse"
    },
    "Violet Executer": {
        "character": "Theresa Apocalypse",
        "version": "2.2.1",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Physical, Bleed, Heavy ATK, Burst, Fast ATK",
        "profile": "Flexible mid-ranged DPS.Long range: AOE knock back.Powerful passives. Synergizes with Bleeding debuff.",
        "leader": "Execution Time",
        "leaderEffect": "Burst/Ultimate attacks deal 12%  more Physical DMG. Teams formed by 3 battlesuits of at least two different types gains 8% Total DMG.",
        "special": "Charge: Impaler",
        "specialEffect": "Charge during the 4-sequence attack to launch a multi-hit upward thrust attack.Impaler: Charge by holding the [ATK] button during the 4-sequence Basic ATK. Reaches full charge in a short time, then release the [ATK] button to deal a 9-sequence attack that deals 100% ATK of Physical DMG per hit and knocks enemies airborne.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Execute Mode",
        "ultimateEffect": "Execute Mode: Enters the Valkyrie state, transforming the 4-sequence Basic ATK into Burst ATKs with greater Interrupt ability.Burst: Consumes 80 SP to enter an 8s burst mode with CC immunity.1st Sequence: 2 x 75% ATK of Physical DMG.2nd Sequence: 2 x 65% ATK of Physical DMG.3rd Sequence: 2 x (50 + 70%) ATK of Physical DMG.4th Sequence: 2 x (60% + 80% + 100%) ATK of Physical DMG.",
        "evasion": "Iron Maiden",
        "evasionEffect": "Quick sideways dodge to evade enemy attack. Can be triggered 2 times in a row.After Ultimate Evasion, gain 40% Move Speed for 3s.Iron Maiden: Drops a giant halberd out of the air upon an Ultimate Evasion, dealing 200% ATK of Physical DMG to the attacker and surrounding enemies and knocking them down. CD: 15s.",
        "basic": "Lance of Longinus",
        "basicEffect": "Basic ATK: Mid-range 4-sequence attack with ethereal halberds.1st Sequence: 3 x 30% ATK of Physical DMG.2nd Sequence: 3 x 30% ATK of Physical DMG.3rd Sequence: 4 x 45% ATK of Physical DMG.4th Sequence: 6 x 45% ATK of Physical DMG against enemies within a mall AOE.",
        "name": "Violet Executer"
    },
    "White Comet": {
        "character": "Kiana Kaslana",
        "version": "1.8",
        "rank": "B",
        "type": "MECH",
        "core_strengths": "Physical, Stun, Burst, Time Mastery",
        "profile": "Melee attacker with stable DPS.Good at interrupting the enemy.High survivability.",
        "leader": "Comet Bless",
        "leaderEffect": "Team gains 10% Max HP in battle.",
        "special": "Combo Skill: Comet Fall",
        "specialEffect": "Attacks enemy with a double-kick, punting it into the air and then bringing it down.Punt: 50% of ATK of Physical DMG.Bring Down: 275% of ATK of AOE Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Neko-Charm!",
        "ultimateEffect": "Activates Valkyrie's burst mode and consumes SP.Burst: Consumes SP continuously to gain Attack Speed and Ignore Interrupt.Consumes 20 SP (at over 100 SP) to activate and 10 SP/s afterwards until SP is depleted; max duration: 60s.",
        "evasion": "Neko Cartwheel",
        "evasionEffect": "Quickly cartwheels away to evade enemy attacks. Can be performed twice in a row.Time Fracture: Triggers a 3s Time Fracture upon Ultimate Evasion; CD: 15s.",
        "basic": "Meteor Kata",
        "basicEffect": "5-sequence Gun Kata.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 100% ATK of Physical DMG.3rd Sequence: 100% ATK of Physical DMG.4th Sequence: 150% x 2 ATK of Physical DMG.5th Sequence: 250% ATK of Physical DMG.",
        "name": "White Comet"
    },
    "Wolf's Dawn": {
        "character": "Bronya Zaychik",
        "version": "2.2.2",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Stun, Weaken, Time Mastery",
        "profile": "Diversionary ranged DPS.Autonomous Project Bunny distracts the enemy.Excels against solo enemies. Good survivability.",
        "leader": "Harmonic Resonance",
        "leaderEffect": "When Combo Hit Count exceeds 30, team gains 15% Crit Rate. PSY-type characters gain 20% Crit DMG.",
        "special": "Switch: Burst Assault",
        "specialEffect": "Immediately unleashes Shield Charge upon entry.Shield Charge: 250% ATK of Physical DMG.Project Bunny (summoned entity) enters battle.Project Bunny stats: 40% ATK, 100% DEF and 400% HP of the Valkyrie; 50% Elemental DMG resistance; and immunity to most crowd controls.The Valkyrie loses 20% ATK during Project Bunny's presence.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Project Bunny will be paralyzed once its HP depleted. Project Bunny restores 5% HP per second. If the Valkyrie goes near Project Bunny to help, it additionally restores 30% HP per second. Project Bunny revives when its HP is fully restored.Project Bunny: Knock surrounding enemies into the air upon revival. When Wolf's Dawn is nearby, Project Bunny gains 60% Physical DMG for 10s.",
        "ultimate": "GROM Slam",
        "ultimateEffect": "Activate powerful resonance with Project Bunny to have it unleash devastating attacks.Resonance: Project Bunny smashes the ground 3 times to damage and stun enemies, and applies Time Lock on weakened enemies for 5s.1st Smash: 275% Project Bunny's ATK of Physical DMG.2nd Smash: 425% Project Bunny's ATK of Physical DMG.3rd Smash: 575% Project Bunny's ATK of Physical DMG.SP Cost: 55.",
        "evasion": "Simulated Flicker",
        "evasionEffect": "Enters temporary Dimension Shift to evade enemy attacks.Simulated Flicker: Summons Project Bunny to attack enemies upon an Ultimate Evasion, dealing 350% Project Bunny's ATK of Physical DMG and triggering Time Fracture for 3s on hit. CD: 15s.If Project Bunny is paralyzed, Ultimate Evasions will heal it for 50% HP.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged ATK using a cannon. Higher charge sequence deals more DMG.Arm Switch Changes the way of charging based on the weapon equipped.Uncharged attacks order Project Bunny to unleash special attacks on the target.",
        "name": "Wolf's Dawn"
    },
    "Yamabuki Armor": {
        "character": "Bronya Zaychik",
        "version": "1.8",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Impair, Burst, Time Mastery, Heal",
        "profile": "Stable ranged DPS.Mecha shield protects the whole team.Ultimate: Heals team HP.",
        "leader": "Mental Sync",
        "leaderEffect": "When Combo Hit Count exceeds 30, team gains 20% Crit Rate. PSY-type characters gain 20% Crit DMG.",
        "special": "Switch: Shield Charge",
        "specialEffect": "Switch skill immediately unleashes a Shield Charge.Shield Charge: 150% ATK of Physical DMG and knocks enemy into the air.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Overdrive Mode",
        "ultimateEffect": "Unlocks the Mecha's energy restrictions to enter Burst mode: Overdrive.Overdrive Cost: At over 40 SP, consumes 10 SP to enter Burst mode and 10 SP/s afterwards until SP is depleted during which the Valkyrie gains Iron Body.Overdrive Switch: Tap [Ultimate] to switch off Overdrive.Heat Reset: Heat meters of laser-type weapons will be reset upon Burst activation.",
        "evasion": "Dimension Field",
        "evasionEffect": "Raises the shield to defend against frontal attacks.Counterstrike: Release the [Defense] button at the moment of the attack to unleash a counterstrike, dealing 100% ATK of Physical DMG.Perfect Defense: Counterstrike triggers a 5s Time Fracture, during which the Valkyrie gains 50% Move Speed and 30% ATK Speed for 3s. Base CD of Perfect Defense: 15s.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged cannon fire that deals greater DMG with higher charge sequence.Arm Switch: Charging mode changes with type of weapon equipped.",
        "name": "Yamabuki Armor"
    },
    "Danzai Spectramancer": {
        "character": "Raiden Mei",
        "core": "Shadow Dash",
        "version": "4.2",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Heavy ATK",
        "leader": "Phantom Outbreak",
        "leaderEffect": "Team gains 21% Crit Rate at above 80% HP.",
        "special": "Combo: Shinkage Flash",
        "specialEffect": "Bunshin Specters emerge from enemy location and deal high damage.Bunshin Specters emerge from enemy location and deal AOE damage.Below 100 Munen: Cannot cast;Below 200 Munen: Consume 100 Munen to create 2 Bunshin Specters dealing 200% +200% ATK of Physical DMG;At 200 Munen: Consume 100 Munen to create 4 Bunshin Specters dealing 200% +250% ATK of Physical DMG. Tap [ATK] again to consume another 100 Munen and cast Shinkage II dealing 400% ATK of Physical DMG.",
        "passive": "Passive Skill",
        "passiveEffect": "Passive bonuses apply automatically.Munen Focus: Starts at 0 and maxes at 200.Regen Sources: Basic ATK 2nd/3rd/4th/5th sequences, Ultimate Evasion, and passive regen on standby.",
        "ultimate": "Tsukiyo's Spectramancy",
        "ultimateEffect": "Attack enemies continuously and create Bunsin Specters to fight together.Charge at the enemy dealing 100%+100%+150%+450% ATK of Physical DMG and create 6 Bunshin Specters after landing to impale the enemy, each dealing 200% ATK of Physical DMG. Casting Ultimate grants 3 Kagenai Recharges. Casting Shinkage I consumes 1 Kagenai Recharge and boosts Total DMG of this Shinkage I/II by 50%. Kagenai Recharges are shared across the team and have a 4.5s proc CD.SP cost: 75. Base CD: 20s.",
        "evasion": "Untouchable Yozakura",
        "evasionEffect": "Quick dash to evade enemy attacks. Tap [ATK] after evasion to charge forward dealing 100% ATK of Physical DMG.Ultimate Evasion restores 100 Munen.Hangeki Reprisal: Hold [ATK] after Untouchable Yozakura lands to immediately perform Shinkage Flash I or II without Munen cost. CD: 10s.",
        "basic": "Gozan",
        "basicEffect": "AOE penta-slash.1st sequence: 80% ATK of Physical DMG.2nd sequence: 100% ATK of Physical DMG & 20 Munen regen.3rd sequence: 50% ATK of Physical DMG & 20 Munen regen.4th sequence: 150% ATK of Physical DMG & 30 Munen regen.5th sequence: 250% ATK of AOE Physical DMG & 30 Munen regen. If interrupted, the 5th sequence will be finished by the Bunshin Specter.",
        "name": "Danzai Spectramancer"
    },
    "Drive Kometa": {
        "character": "Bronya Zaychik",
        "core": "Yamabuki Armor",
        "version": "3.1",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Gather, Weaken, Burst, Time Mastery",
        "leader": "Mental Sync",
        "leaderEffect": "When Combo Hit Count exceeds 30, team gains 20% Crit Rate. PSY-type characters gain 20% Crit DMG.",
        "special": "Switch: Gravity Slam",
        "specialEffect": "Switch skill immediately unleashes a Shield Charge.Shield Charge: 150% ATK of Physical DMG and knocks enemy into the air.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.No interruption when the shield is shattered by Physical DMG.",
        "ultimate": "Obliterate Mode",
        "ultimateEffect": "Lifts power restrictions on the Mech to enter Obliterate Mode (Burst).Instantly gathers and knocks up nearby enemies to deal 150% + 400% ATK of Physical DMG. Resets shield and enter Obliterate Mode. Duration: 15s. Yamabuki Armor gains Iron Body during this period. Shield resets every 3s.1st Strike: 100% Physical DMG.2nd Strike: 2 x 70% Physical DMG.3rd Strike: Warps gravity to deal 160% Physical DMG and Time Lock enemies within range, and gathers nearby enemies for 2s.SP cost: 50. CD: 25s.",
        "evasion": "Super Gravity",
        "evasionEffect": "Raises the shield to defend against frontal attacks.Counterstrike: Release the [Defense] button at the moment of the attack to unleash a counterstrike.Perfect Defense: Counterstrike triggers Time Fracture, slowing all enemies for 5s and accelerates the character's Move SPD by 50% and Attack SPD by 30% for 3s. Perfect Defense base CD: 15s.Gravity Reflex: Raises shield faster and enters mobility mode more quickly.",
        "basic": "Charge: Particle Cannon",
        "basicEffect": "Charged cannon fire that deals greater DMG with higher charge sequence.Arm Switch: Charging mode changes with type of weapon equipped",
        "name": "Drive Kometa"
    },
    "Fervent Tempo Δ": {
        "character": "Rozaliya Olenyeva",
        "core": "Molotov Cherry",
        "version": "4.3",
        "rank": "S",
        "type": "PSY",
        "core_strengths": "Physical, Gather, Time Mastery",
        "leader": "SHOWTIME!",
        "leaderEffect": "Entire team gains 20.0% Melee Physical DMG.",
        "special": "Charged ATK: Dissociated Harmony",
        "specialEffect": "Attack enemies with the weapon fully charged.Condition: full CYAN Juice & PINK Juice.Consume all Juice to deal 400% ATK of Physical DMG and enter Fervent Mode.1st Sequence: 240% ATK of Physical DMG.2nd Sequence: 240% ATK of Physical DMG.3rd Sequence: 560% ATK of Physical DMG.In Fervent Mode: Valkyrie has improved Ignore Interrupt; Charged ATK is disabled; PINK/CYAN Juice cannot be restored.",
        "passive": "Double Stencil",
        "passiveEffect": "Passive bonuses apply automatically.CYAN & PINK Juice: Starts at 0 and maxes at 1,200. Different moves restore different Juice.With full CYAN & PINK Juice, Charged ATK consumes all Juice to induce Fervent Mode and evolve Valkyrie's skillset.Valkyrie enters Fervent Mode with 2,400 Fervent Juice (4,800 max) and consumes 75 per 0.2s. Fervent Mode ends when Fervent Juice runs out.",
        "ultimate": "Phantom Memories",
        "ultimateEffect": "Adopts DEF stance to negate incoming attacks.Maintain DEF Stance for up to 0.7s.When DEF Stance ends or when attacked while it's active, performs Strike Back to deal 400% + 400% ATK of Physical DMG.If attacked upon activating DEF Stance, then performs Strike Back EX to deal 100% + 400% + 1,000% ATK of Physical DMG and trigger a 1.6s global Time Fracture.Valkyrie enters Fervent Mode upon Ultimate, and CYAN/PINK Juice will resume to previous levels after Fervent Mode ends.SP cost: 50. Base CD: 9s.",
        "evasion": "Trick Evader",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a row and grants 200 PINK Juice.VODKA SHIELD: Ultimate Evasion triggers 3s of global Time Fracture, grants 400 PINK Juice and a barrier lasting 6s which can absorb Total DMG equal to 15% max HP. CD: 15s.In Fervent Mode, no Fervent Juice is consumed within 3s after Time Fracture is triggered.",
        "basic": "Blazing Tones",
        "basicEffect": "Greatsword attack.1st Sequence: 120% ATK of Physical DMG.2nd Sequence: 70% + 70% ATK of Physical DMG.3rd Sequence: 40% + 120% ATK of Physical DMG.4th Sequence: 180% ATK of Physical DMG.5th Sequence: 140% + 140% ATK of Physical DMG.6th Sequence: 300% ATK of Physical DMG.Evade and attack during the first 3 sequences to perform the next sequence.Evade and attack during the 4th to 6th sequence to perform the 4th sequence.Each sequence grants 150 CYAN Juice.",
        "name": "Fervent Tempo Δ"
    },
    "Hawk of the Fog": {
        "character": "Fu Hua",
        "core": "Valkyrie Accipiter",
        "version": "3.5",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Lightning DMG, Heavy ATK, Paralyze, Time Mastery",
        "leader": "Chelonic Unity",
        "leaderEffect": "When Combo Hit Count exceeds 30, [[Mei]] and [[Kiana]] in the team gain 22% Crit Rate; when Combo Hit Count is below 30, [[Bronya]] in the team gains 28% Crit DMG.",
        "special": "Combo ATK: Lightning Panther",
        "specialEffect": "Different Six Fists moves can be connected to various Combo ATKs.Kei: Whipping Sparks: Launches Ki blades dealing 100% ATK of Lightning DMG per hit (additionally deals 100% ATK of Lightning DMG against enemies outside a 4m radius). Within 1s after hitting enemies outside the 4m radius, tap [ATK] or [ULT] to perform Ki: Lightning Pounce, dashing towards the target and dealing 200% ATK of Lightning DMG.Kei Taranic Talons: Deals 180% ATK of Lightning DMG.Kei: Six-Sided Shock: Deals 100% + 8% x 80% + 200% ATK of Lightning DMG. Use the joystick to set the finishing position.Kei: Blasting Palm: After unleashing Kei: Six-Sided Shock, tap [ATK] to perform this Combo, dealing 450% ATK of Lightning DMG and knocking back the target. The target additionally deals 200% ATK of Lightning DMG if knocked into a wall.Kei: Tunneling Blossom: Tap [ULT] during Kei: Six-Sided Shock to perform, dealing 450% ATK of Lightning DMG. Navigate the charging direction with the joystick.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.",
        "ultimate": "Raging Tiamat",
        "ultimateEffect": "Consume 50 SP to unleash burst attacks during Combo ATK.Increases max SP by 50. Hold [ULT] during Kei: Tunneling Blossom or after triggering Time Fracture with Ultimate Evasion to deal 750% x 2 ATK of Lightning DMG and gather enemies.",
        "evasion": "Storm Phoenix",
        "evasionEffect": "Move fast to dodge attacks.Within 3s after Ultimate Evasion, hit enemies with Kei: Whipping Sparks to proc Ki: Lightning Pounce.Time Fracture: Ultimate Evasion procs global Time Fracture, slowing all enemies for 3s. CD: 15s.",
        "basic": "Thunder Wyrm",
        "basicEffect": "Use the Six Fists for battle.The Six Fists:1st Stance: 80% ATK of Physical DMG.2nd Stance: 80% ATK of Physical DMG.3rd Stance: 80% ATK of Physical DMG.4th Stance: 2 x 100% ATK of Physical DMG.5th Stance: 2 x 80% ATK of Physical DMG.6th Stance: 150% ATK of Physical DMG.",
        "name": "Hawk of the Fog"
    },
    "Striker Fulminata": {
        "character": "Raiden Mei",
        "version": "3.0",
        "rank": "A",
        "type": "BIO",
        "core_strengths": "",
        "core": "Valkyrie Bladestrike",
        "leader": "Sakura Aura",
        "leaderEffect": "Team gains 25% DEF in battle. BIO-type characters gain 5% Max HP.",
        "special": "Combo: Void Edge",
        "specialEffect": "Slash flurry attack.Tap the [ATK] button during Blade Flurry to keep triggering Blade Flurry (limit: 2 times).Charges toward the enemy: 50% ATK of Physical DMG.Flurry: 6x30% ATK of Physical DMG.Fatal Slash: 2x80% + 100% ATK of Physical DMG.Burst: Charges toward the enemy and deals 40%+30% ATK of Physical DMG.Flurry: 4x40%+2x30% ATK of Physical DMG.Fatal Slash:4x70% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Character automatically gains passive bonuses.In both Normal and Burst modes, the 2nd, 3rd, and 5th sequence of Basic ATKs recovers 1, 1, and 2 EM Reserve(s) respectively upon hit.",
        "ultimate": "Takemikazuchi",
        "ultimateEffect": "Enter Burst mode and recover 4 EM Reserves.Burst: Deals 3x100%+550% ATK of Physical DMG to nearby enemies.Continuous Burst: Consumes 20 SP to activate and 8 SP/s afterwards. Max duration: 10s.Burst Basic ATK:1st Sequence: 60%+40% ATK of Physical DMG.2nd Sequence: 80%+40% ATK of Physical DMG.3rd Sequence: 80%+40% ATK of Physical DMG.4th Sequence: 100%+40% ATK of Physical DMG.5th Sequence: 150%+3x80% ATK of Physical DMG, and paralyzes enemies hit for 1.5s. At over 100 SP, consumes 20 SP to activate and 8 SP/s afterwards; max duration: 10s.",
        "evasion": "Raikage",
        "evasionEffect": "Quickly evade enemy attacks. Can be performed twice in a row.Raikage: Ultimate Evasions trigger a 3s Time Fracture and restores 1 EM Reserve. Duration: 3s; CD: 15s.When the Valkyrie has any EM Reserve, tap [ATK] during Evasion to consume 1 EM Reserve and throw the Gotamashi Edge toward the enemy, dealing 120% ATK of AOE Physical DMG; restores 2 EM Reserves (in non-Burst mode) and charges toward the enemy, dealing 80% (130%+30% in Burst mode) ATK of Physical DMG and triggering Blade Flurry.",
        "basic": "Gozan Raimei",
        "basicEffect": "AOE penta-slash.1st Sequence: 80% ATK of Physical DMG.2nd Sequence: 100% ATK of Physical DMG.3rd Sequence: 100% ATK of Physical DMG.4th Sequence: 120% ATK of Physical DMG.5th Sequence: 120%+2x75% ATK of AOE Physical DMG, and paralyzes enemies hit for 0.8s.",
        "name": "Striker Fulminata"
    },
    "Twilight Paladin": {
        "character": "Theresa Apocalypse",
        "core": "Violet Executer",
        "version": "3.4",
        "rank": "S",
        "type": "MECH",
        "core_strengths": "Physical, Bleed, Fast ATK, Time Mastery",
        "leader": "Execution Time",
        "leaderEffect": "During Burst/Ultimate, gain 12% Physical DMG. A team with 3 battlesuits of different types gains 8% Total DMG Multiplier.",
        "special": "Unfettered Rage",
        "specialEffect": "At max Fervor, tap and hold [ATK] to leech blood and enter Fervent state.Activation: Dashes towards enemies, deals 4 x 160% ATK of Physical DMG, and knocks enemies airborne.Fervent buffs: Ignore Interrupt and 40% Total DMG Reduction.1st Sequence: 4 x 50% ATK of Physical DMG.2nd Sequence: 4 x 50% ATK of Physical DMG.3rd Sequence: 4 x (45% + 30%) ATK of Physical DMG.4th Sequence: 180% + Hit count (Max: 12) x 60% ATK of Physical DMG.5th Sequence: 4 x 70% + 150% + 3 x 100% + 190% ATK of Physical DMG, inflicts 5s Bleeding that deals 50 Physical DMG per 0.5s.Fervent Charged ATK: Dashes to enemies and deals 4 x 120% ATK of Physical DMG.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Fervor: Starts at 0 and maxes at 500. At max Fervor, tap and hold [ATK] to turn Fervent.Fervent state Fervor consumption:0-6s: 5 per 0.1s6-12s: 7.5 per 0.1s12+s: 10 per 0.1s.Fervent ends once Fervor is depleted.",
        "ultimate": "Crescent Edict",
        "ultimateEffect": "The execution starts now!Fangs of Dusk knock enemies in the AOE airborne, dealing 4 x 80% ATK of AOE Physical DMG. Then split 4 Fangs of Dusk into a shower of microblades that deal 10 x 120% ATK of Physical DMG. Ends by summoning a giant Cross that smashes enemies and deals 600% ATK of Physical DMG.When Ultimate ends, Theresa gains 15% Crit Rate for 15s.SP cost: 100. CD: 15s.",
        "evasion": "Saint of Edda",
        "evasionEffect": "Quick side-step evasion. Can be triggered twice in a row.Ultimate Evasion triggers Fang Execution that gives 40% faster Movement Speed for 3s.Fang Execution: Triggers 3s Time Fracture, gives 100 Fervor, and launches spinning Fangs of Dusk at targets that deal 19 x 8% ATK of Physical DMG in normal mode (Fervent state: 19 x 16% ATK of Physical DMG). Hits bleed targets, dealing 50 Physical DMG per ''0.5s'' for 5s.Fang Execution CD: 15s.",
        "basic": "Fangs of Dusk",
        "basicEffect": "Basic ATK: Mid-range 4-sequence flying blades attack.1st Sequence: 3 x 40% ATK of Physical DMG.2nd Sequence: 3 x 45% ATK of Physical DMG.3rd Sequence: 6 x 30% ATK of Physical DMG.4th Sequence: 11 x 45% ATK of small AOE Physical DMG.Each hit on enemies gives 7 Fervor.The 4th Sequence inflicts 5s Bleeding that deals 50 Physical DMG per 0.5s.",
        "name": "Twilight Paladin"
    },
    "Void Drifter": {
        "character": "Kiana Kaslana",
        "version": "3.3",
        "rank": "A",
        "type": "MECH",
        "core_strengths": "Physical, Gather, Bleed",
        "core": "Valkyrie Ranger",
        "leader": "Flying Comet",
        "leaderEffect": "Team gains 10% Move Speed. MECH-type characters gain 5% Attack Speed.",
        "special": "Combo: Void Flechette",
        "specialEffect": "Attack the enemy with a Subspace Lance.Combo ATK keys: Tap and hold the [ATK] button.1st sequence: 200% ATK of Physical DMG.2nd sequence: 150% + 150% ATK of Physical DMG.3rd sequence: 300% ATK of Physical DMG.Each Combo ATK performed: +100 Herrscher Charge.",
        "passive": "Passive",
        "passiveEffect": "Passive bonuses apply automatically.Herrscher Charge: Starts at 0 (Max: 600).Character gains 50 Max SP. At full Herrscher Charge, character enters Inner Turmoil for 3s. Character cannot ATK, Evade, or use weapon skills for this duration. Nearby enemies are stunned for 3s. Stun CD: 10s. When Inner Turmoil ends, Herrscher Charge decays to ZERO (at 50 per 0.75s). Combo ATK can only be performed after Herrscher Charge decays to ZERO. Inner Turmoil can be canceled by switching characters or casting Ultimate.",
        "ultimate": "Void Impact",
        "ultimateEffect": "Unleash Herrscher powers to attack nearby enemies.Applies Time Slow to nearby enemies and deals 2,000% ATK  of Physical DMG and inflicts a 12s Voidmark.Casting the Ultimate resets Herrscher Charge.SP cost: 100. Base CD: 30s.",
        "evasion": "Zeitstrom",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed 2 times in a row.Zeitflux: Deals 300% ATK of Physical DMG against nearby enemies upon Ultimate Evasion and generates a 3s Enerstrom that pulls in enemies and inflicts a 12s Voidmark; CD: 10s.Loses 50 Herrscher Charge when generating Enerstorm.",
        "basic": "Void Kata",
        "basicEffect": "Gun kata attack.1st sequence: 100% ATK of Physical DMG.2nd sequence: 3 x 50% ATK of Physical DMG.3rd sequence: 2 x 80% ATK of Physical DMG.4th sequence: 150% ATK of Physical DMG and inflicts a 12s Voidmark on the enemy.If 4th sequence hits, then create a 3s Enerstrom to pull in enemies. Enerstrom CD: 10s.Enemies hit by 4th sequence or pulled in by Enerstrom are Voidmarked for 12s.Performing the 4th Basic ATK sequence and Enerstrom: Lose 50 Herrscher Charge.",
        "name": "Void Drifter"
    },
    "Starry Impression": {
        "character": "Griseo",
        "version": "5.8",
        "rank": "A",
        "type": "PSY",
        "core_strengths": "Physical, Bleeding, Time Mastery",
        "profile": "Melee Physical support.Bleed deals high DMG.Ultimate buffs all teammates.",
        "leader": "Self-Portrait: Stars",
        "leaderEffect": "Team deals 17.0% bonus Physical DMG to bleeding enemies and starts battle with 35.0 bonus initial SP. In Open World, the initial SP bonus takes effect once every 10mins.",
        "special": "Combo: Knight Blowing Bubbles",
        "specialEffect": "Attack together with Mr. Knight.Combo ATK is dictated by the number and color of the paints it consumes:If she does not have the max number of paints or paints of all 3 colors, Mr. Knight will consume all paints to knock enemies airborne and deal 400% ATK of Physical DMG.If she has the max number of paints that contain all 3 colors, Mr. Knight will consume all paints to smite enemies and deal 650% ATK of Physical DMG.Casting Combo ATK grants a Prismatic Bubble buff for 10s.Prismatic Bubble: Negates incoming DMG once. Deals 100% ATK of Physical DMG to nearby enemies on blocking, expiry, or being triggered again.",
        "passive": "Impression, Ciel Étoilé",
        "passiveEffect": "Passive bonuses apply automatically.Gain paints through fighting. They have 3 colors and the default paint is red. Tap [ATK] and hit an enemy to gain a paint of the current color. Tap [ULT] to switch colors and hit an enemy to gain a paint of the new color. Gaining a paint grants a corresponding Mixing buff for 20s (gaining it again refreshes the duration).[Mixing: Red]: Deal 20% bonus Total DMG to shield-broken or unshielded enemies.[Mixing: Yellow]: Take 15% less Total DMG.[Mixing: Blue]: Bleeding inflicted by her deals 35% bonus Physical DMG.Stop gaining paints or Mixing buffs at the max number of paints.",
        "ultimate": "Neverland Genesis",
        "ultimateEffect": "Exhibit a painting that materializes and attacks upon auto-completion.Casting Ultimate causes Global Time Fracture for 2s. Teammates on the field can inflict 2 [[Bleed Trauma]] (CD: 2s). Ultimate lasts 18s, during which the number of paints is capped at 5. When Ultimate has 8s left, deal 500% ATK of Physical DMG in an area. During Ultimate, her exit refreshes the duration of Mixing buffs and grants teammates the same Mixing buffs.SP cost: 75. CD: 20s.",
        "evasion": "The Birth of the Depicter",
        "evasionEffect": "Quickly dodge enemy attacks. Can be performed twice in a row.Ultimate Evasion Skill: Causes Global Time Fracture for 2s (CD: 15s).",
        "basic": "The Painter and The Knight",
        "basicEffect": "Fight using a paintbrush and with the help of Mr. Knight.SEQ 1: 80% ATK of Physical DMG.SEQ 2: 100% ATK of Physical DMG.SEQ 3: 120% ATK of Physical DMG.SEQ 4: 80% + 80% ATK of Physical DMG.SEQ 5: 180% ATK of Physical DMG.",
        "name": "Starry Impression"
    }
}